21mw12/CW32_Voltammeter/电压电流表资料/数据手册及标准库资料/CW32F003_StandardPeripheralLib_V1.5/Libraries/inc/cw32f003.h
    struct {
      __IOM uint32_t WCNT       : 7;            /*!< [6..0] desc WCNT                                                          */
      __IOM uint32_t EN         : 1;            /*!< [7..7] desc EN                                                            */
    } CR0_f;
  } ;
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000004) Control register2                                          */
    
    struct {
      __IOM uint32_t WINR       : 7;            /*!< [6..0] desc WINR                                                          */
      __IOM uint32_t PRS        : 3;            /*!< [9..7] desc PRS                                                           */
      __IOM uint32_t IE         : 1;            /*!< [10..10] desc IE                                                          */
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< (@ 0x00000008) Status register                                            */
    
    struct {
      __IOM uint32_t POV        : 1;            /*!< [0..0] desc POV                                                           */
    } SR_f;
  } ;
} WWDT_TypeDef;                                    /*!< Size = 12 (0xc)                                                           */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define ADC_BASE                                 0x40012400UL
#define ATIM_BASE                                0x40012C00UL
#define AWT_BASE                                 0x40014C00UL
#define BTIM1_BASE                               0x40014800UL
#define BTIM2_BASE                               0x40014900UL
#define BTIM3_BASE                               0x40014A00UL
#define CRC_BASE                                 0x40023000UL
#define FLASH_BASE                               0x40022000UL
#define GPIOA_BASE                               0x48000000UL
#define GPIOB_BASE                               0x48000400UL
#define GPIOC_BASE                               0x48000800UL
#define GTIM_BASE                                0x40000400UL
#define I2C_BASE                                 0x40005400UL
#define IWDT_BASE                                0x40003000UL
#define LVD_BASE                                 0x40012A80UL
#define RAM_BASE                                 0x40022400UL
#define SPI_BASE                                 0x40013000UL
#define SYSCTRL_BASE                             0x40010000UL
#define UART1_BASE                               0x40013800UL
#define UART2_BASE                               0x40004400UL
#define VC1_BASE                                 0x40012A00UL
#define VC2_BASE                                 0x40012A10UL
#define WWDT_BASE                                0x40002C00UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define CW_ADC                                   ((ADC_TypeDef*)ADC_BASE)
#define CW_ATIM                                  ((ATIM_TypeDef*)ATIM_BASE)
#define CW_AWT                                   ((AWT_TypeDef*)AWT_BASE)
#define CW_BTIM1                                 ((BTIM_TypeDef*)BTIM1_BASE)
#define CW_BTIM2                                 ((BTIM_TypeDef*)BTIM2_BASE)
#define CW_BTIM3                                 ((BTIM_TypeDef*)BTIM3_BASE)
#define CW_CRC                                   ((CRC_TypeDef*)CRC_BASE)
#define CW_FLASH                                 ((FLASH_TypeDef*)FLASH_BASE)
#define CW_GPIOA                                 ((GPIO_TypeDef*)GPIOA_BASE)
#define CW_GPIOB                                 ((GPIO_TypeDef*)GPIOB_BASE)
#define CW_GPIOC                                 ((GPIO_TypeDef*)GPIOC_BASE)
#define CW_GTIM                                  ((GTIM_TypeDef*)GTIM_BASE)
#define CW_I2C                                   ((I2C_TypeDef*)I2C_BASE)
#define CW_IWDT                                  ((IWDT_TypeDef*)IWDT_BASE)
#define CW_LVD                                   ((LVD_TypeDef*)LVD_BASE)
#define CW_RAM                                   ((RAM_TypeDef*)RAM_BASE)
#define CW_SPI                                   ((SPI_TypeDef*)SPI_BASE)
#define CW_SYSCTRL                               ((SYSCTRL_TypeDef*)SYSCTRL_BASE)
#define CW_UART1                                 ((UART_TypeDef*)UART1_BASE)
#define CW_UART2                                 ((UART_TypeDef*)UART2_BASE)
#define CW_VC1                                   ((VC_TypeDef*)VC1_BASE)
#define CW_VC2                                   ((VC_TypeDef*)VC2_BASE)
#define CW_WWDT                                  ((WWDT_TypeDef*)WWDT_BASE)

#define M0P_ADC                                  CW_ADC
#define M0P_ATIM                                 CW_ATIM
#define M0P_AWT                                  CW_AWT
#define M0P_BTIM1                                CW_BTIM1
#define M0P_BTIM2                                CW_BTIM2
#define M0P_BTIM3                                CW_BTIM3
#define M0P_CRC                                  CW_CRC
#define M0P_FLASH                                CW_FLASH
#define M0P_GPIOA                                CW_GPIOA
#define M0P_GPIOB                                CW_GPIOB
#define M0P_GPIOC                                CW_GPIOC
#define M0P_GTIM                                 CW_GTIM
#define M0P_I2C                                  CW_I2C
#define M0P_IWDT                                 CW_IWDT
#define M0P_LVD                                  CW_LVD
#define M0P_RAM                                  CW_RAM
#define M0P_SPI                                  CW_SPI
#define M0P_SYSCTRL                              CW_SYSCTRL
#define M0P_UART1                                CW_UART1
#define M0P_UART2                                CW_UART2
#define M0P_VC1                                  CW_VC1
#define M0P_VC2                                  CW_VC2
#define M0P_WWDT                                 CW_WWDT

