21mw12/CW32_Voltammeter/电压电流表资料/数据手册及标准库资料/CW32F003_StandardPeripheralLib_V1.5/Libraries/inc/cw32f003.h
#define ATIM_CH3CR_BUFEA_Pos                     (6UL)            /*!<BUFEA(Bit6)*/
#define ATIM_CH3CR_BUFEA_Msk                     (0x40UL)            /*!<BUFEA(Bitfield-Mask:0x01)*/
#define ATIM_CH3CR_CSB_Pos                       (5UL)            /*!<CSB(Bit5)*/
#define ATIM_CH3CR_CSB_Msk                       (0x20UL)            /*!<CSB(Bitfield-Mask:0x01)*/
#define ATIM_CH3CR_CSA_Pos                       (4UL)            /*!<CSA(Bit4)*/
#define ATIM_CH3CR_CSA_Msk                       (0x10UL)            /*!<CSA(Bitfield-Mask:0x01)*/
#define ATIM_CH3CR_BKSB_Pos                      (2UL)            /*!<BKSB(Bit2)*/
#define ATIM_CH3CR_BKSB_Msk                      (0xcUL)            /*!<BKSB(Bitfield-Mask:0x03)*/
#define ATIM_CH3CR_BKSA_Pos                      (0UL)            /*!<BKSA(Bit0)*/
#define ATIM_CH3CR_BKSA_Msk                      (0x3UL)            /*!<BKSA(Bitfield-Mask:0x03)*/
/* =========================================================  CH4CR  ========================================================= */
#define ATIM_CH4CR_C4EN_Pos                      (5UL)            /*!<C4EN(Bit5)*/
#define ATIM_CH4CR_C4EN_Msk                      (0x20UL)            /*!<C4EN(Bitfield-Mask:0x01)*/
#define ATIM_CH4CR_CIS_Pos                       (3UL)            /*!<CIS(Bit3)*/
#define ATIM_CH4CR_CIS_Msk                       (0x18UL)            /*!<CIS(Bitfield-Mask:0x03)*/
#define ATIM_CH4CR_CIE_Pos                       (1UL)            /*!<CIE(Bit1)*/
#define ATIM_CH4CR_CIE_Msk                       (0x2UL)            /*!<CIE(Bitfield-Mask:0x01)*/
#define ATIM_CH4CR_BUFE_Pos                      (0UL)            /*!<BUFE(Bit0)*/
#define ATIM_CH4CR_BUFE_Msk                      (0x1UL)            /*!<BUFE(Bitfield-Mask:0x01)*/
/* ==========================================================  DTR  ========================================================== */
#define ATIM_DTR_VCE_Pos                         (14UL)            /*!<VCE(Bit14)*/
#define ATIM_DTR_VCE_Msk                         (0x4000UL)            /*!<VCE(Bitfield-Mask:0x01)*/
#define ATIM_DTR_SAFEEN_Pos                      (13UL)            /*!<SAFEEN(Bit13)*/
#define ATIM_DTR_SAFEEN_Msk                      (0x2000UL)            /*!<SAFEEN(Bitfield-Mask:0x01)*/
#define ATIM_DTR_MOE_Pos                         (12UL)            /*!<MOE(Bit12)*/
#define ATIM_DTR_MOE_Msk                         (0x1000UL)            /*!<MOE(Bitfield-Mask:0x01)*/
#define ATIM_DTR_AOE_Pos                         (11UL)            /*!<AOE(Bit11)*/
#define ATIM_DTR_AOE_Msk                         (0x800UL)            /*!<AOE(Bitfield-Mask:0x01)*/
#define ATIM_DTR_BKE_Pos                         (10UL)            /*!<BKE(Bit10)*/
#define ATIM_DTR_BKE_Msk                         (0x400UL)            /*!<BKE(Bitfield-Mask:0x01)*/
#define ATIM_DTR_DTEN_Pos                        (9UL)            /*!<DTEN(Bit9)*/
#define ATIM_DTR_DTEN_Msk                        (0x200UL)            /*!<DTEN(Bitfield-Mask:0x01)*/
#define ATIM_DTR_DTR_Pos                         (0UL)            /*!<DTR(Bit0)*/
#define ATIM_DTR_DTR_Msk                         (0xffUL)            /*!<DTR(Bitfield-Mask:0xff)*/
/* ==========================================================  RCR  ========================================================== */
#define ATIM_RCR_UD_Pos                          (9UL)            /*!<UD(Bit9)*/
#define ATIM_RCR_UD_Msk                          (0x200UL)            /*!<UD(Bitfield-Mask:0x01)*/
#define ATIM_RCR_OV_Pos                          (8UL)            /*!<OV(Bit8)*/
#define ATIM_RCR_OV_Msk                          (0x100UL)            /*!<OV(Bitfield-Mask:0x01)*/
#define ATIM_RCR_RCR_Pos                         (0UL)            /*!<RCR(Bit0)*/
#define ATIM_RCR_RCR_Msk                         (0xffUL)            /*!<RCR(Bitfield-Mask:0xff)*/
/* ========================================================  CH1CCRA  ======================================================== */
#define ATIM_CH1CCRA_CCR1A_Pos                   (0UL)            /*!<CCR1A(Bit0)*/
#define ATIM_CH1CCRA_CCR1A_Msk                   (0xffffUL)            /*!<CCR1A(Bitfield-Mask:0xffff)*/
/* ========================================================  CH1CCRB  ======================================================== */
#define ATIM_CH1CCRB_CCR1B_Pos                   (0UL)            /*!<CCR1B(Bit0)*/
#define ATIM_CH1CCRB_CCR1B_Msk                   (0xffffUL)            /*!<CCR1B(Bitfield-Mask:0xffff)*/
/* ========================================================  CH2CCRA  ======================================================== */
#define ATIM_CH2CCRA_CCR2A_Pos                   (0UL)            /*!<CCR2A(Bit0)*/
#define ATIM_CH2CCRA_CCR2A_Msk                   (0xffffUL)            /*!<CCR2A(Bitfield-Mask:0xffff)*/
/* ========================================================  CH2CCRB  ======================================================== */
#define ATIM_CH2CCRB_CCR2B_Pos                   (0UL)            /*!<CCR2B(Bit0)*/
#define ATIM_CH2CCRB_CCR2B_Msk                   (0xffffUL)            /*!<CCR2B(Bitfield-Mask:0xffff)*/
/* ========================================================  CH3CCRA  ======================================================== */
#define ATIM_CH3CCRA_CCR3A_Pos                   (0UL)            /*!<CCR3A(Bit0)*/
#define ATIM_CH3CCRA_CCR3A_Msk                   (0xffffUL)            /*!<CCR3A(Bitfield-Mask:0xffff)*/
/* ========================================================  CH3CCRB  ======================================================== */
#define ATIM_CH3CCRB_CCR3B_Pos                   (0UL)            /*!<CCR3B(Bit0)*/
#define ATIM_CH3CCRB_CCR3B_Msk                   (0xffffUL)            /*!<CCR3B(Bitfield-Mask:0xffff)*/
/* ========================================================  CH4CCR  ========================================================= */
#define ATIM_CH4CCR_CCR4_Pos                     (0UL)            /*!<CCR4(Bit0)*/
#define ATIM_CH4CCR_CCR4_Msk                     (0xffffUL)            /*!<CCR4(Bitfield-Mask:0xffff)*/


/* =========================================================================================================================== */
/* ================                                            AWT                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define AWT_CR_SRC_Pos                           (8UL)            /*!<SRC(Bit8)*/
#define AWT_CR_SRC_Msk                           (0x700UL)            /*!<SRC(Bitfield-Mask:0x07)*/
#define AWT_CR_PRS_Pos                           (4UL)            /*!<PRS(Bit4)*/
#define AWT_CR_PRS_Msk                           (0xf0UL)            /*!<PRS(Bitfield-Mask:0x0f)*/
#define AWT_CR_MD_Pos                            (1UL)            /*!<MD(Bit1)*/
#define AWT_CR_MD_Msk                            (0x6UL)            /*!<MD(Bitfield-Mask:0x03)*/
#define AWT_CR_EN_Pos                            (0UL)            /*!<EN(Bit0)*/
#define AWT_CR_EN_Msk                            (0x1UL)            /*!<EN(Bitfield-Mask:0x01)*/
/* ==========================================================  ARR  ========================================================== */
#define AWT_ARR_ARR_Pos                          (0UL)            /*!<ARR(Bit0)*/
#define AWT_ARR_ARR_Msk                          (0xffffUL)            /*!<ARR(Bitfield-Mask:0xffff)*/
/* ==========================================================  CNT  ========================================================== */
#define AWT_CNT_CNT_Pos                          (0UL)            /*!<CNT(Bit0)*/
#define AWT_CNT_CNT_Msk                          (0xffffUL)            /*!<CNT(Bitfield-Mask:0xffff)*/
/* ==========================================================  IER  ========================================================== */
#define AWT_IER_UD_Pos                           (3UL)            /*!<UD(Bit3)*/
#define AWT_IER_UD_Msk                           (0x8UL)            /*!<UD(Bitfield-Mask:0x01)*/
/* ==========================================================  ISR  ========================================================== */
#define AWT_ISR_UD_Pos                           (3UL)            /*!<UD(Bit3)*/
#define AWT_ISR_UD_Msk                           (0x8UL)            /*!<UD(Bitfield-Mask:0x01)*/
/* ==========================================================  ICR  ========================================================== */
#define AWT_ICR_UD_Pos                           (3UL)            /*!<UD(Bit3)*/
#define AWT_ICR_UD_Msk                           (0x8UL)            /*!<UD(Bitfield-Mask:0x01)*/


/* =========================================================================================================================== */
/* ================                                           BTIM                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  ARR  ========================================================== */
#define BTIMx_ARR_ARR_Pos                        (0UL)            /*!<ARR(Bit0)*/
#define BTIMx_ARR_ARR_Msk                        (0xffffUL)            /*!<ARR(Bitfield-Mask:0xffff)*/
/* ==========================================================  CNT  ========================================================== */
#define BTIMx_CNT_CNT_Pos                        (0UL)            /*!<CNT(Bit0)*/
#define BTIMx_CNT_CNT_Msk                        (0xffffUL)            /*!<CNT(Bitfield-Mask:0xffff)*/
/* ==========================================================  ACR  ========================================================== */
#define BTIMx_ACR_ETRFLT_Pos                     (4UL)            /*!<ETRFLT(Bit4)*/
#define BTIMx_ACR_ETRFLT_Msk                     (0x70UL)            /*!<ETRFLT(Bitfield-Mask:0x07)*/
/* ==========================================================  BCR  ========================================================== */
#define BTIMx_BCR_PRSSTATUS_Pos                  (11UL)            /*!<PRSSTATUS(Bit11)*/
#define BTIMx_BCR_PRSSTATUS_Msk                  (0x7800UL)            /*!<PRSSTATUS(Bitfield-Mask:0x0f)*/
#define BTIMx_BCR_PRS_Pos                        (7UL)            /*!<PRS(Bit7)*/
#define BTIMx_BCR_PRS_Msk                        (0x780UL)            /*!<PRS(Bitfield-Mask:0x0f)*/
#define BTIMx_BCR_TOGEN_Pos                      (6UL)            /*!<TOGEN(Bit6)*/
#define BTIMx_BCR_TOGEN_Msk                      (0x40UL)            /*!<TOGEN(Bitfield-Mask:0x01)*/
#define BTIMx_BCR_ONESHOT_Pos                    (5UL)            /*!<ONESHOT(Bit5)*/
#define BTIMx_BCR_ONESHOT_Msk                    (0x20UL)            /*!<ONESHOT(Bitfield-Mask:0x01)*/
#define BTIMx_BCR_POL_Pos                        (4UL)            /*!<POL(Bit4)*/
#define BTIMx_BCR_POL_Msk                        (0x10UL)            /*!<POL(Bitfield-Mask:0x01)*/
#define BTIMx_BCR_TRS_Pos                        (3UL)            /*!<TRS(Bit3)*/
#define BTIMx_BCR_TRS_Msk                        (0x8UL)            /*!<TRS(Bitfield-Mask:0x01)*/
#define BTIMx_BCR_MODE_Pos                       (1UL)            /*!<MODE(Bit1)*/
#define BTIMx_BCR_MODE_Msk                       (0x6UL)            /*!<MODE(Bitfield-Mask:0x03)*/
#define BTIMx_BCR_EN_Pos                         (0UL)            /*!<EN(Bit0)*/
#define BTIMx_BCR_EN_Msk                         (0x1UL)            /*!<EN(Bitfield-Mask:0x01)*/
/* ==========================================================  IER  ========================================================== */
#define BTIMx_IER_TOP_Pos                        (2UL)            /*!<TOP(Bit2)*/
#define BTIMx_IER_TOP_Msk                        (0x4UL)            /*!<TOP(Bitfield-Mask:0x01)*/
#define BTIMx_IER_TI_Pos                         (1UL)            /*!<TI(Bit1)*/
#define BTIMx_IER_TI_Msk                         (0x2UL)            /*!<TI(Bitfield-Mask:0x01)*/
#define BTIMx_IER_OV_Pos                         (0UL)            /*!<OV(Bit0)*/
#define BTIMx_IER_OV_Msk                         (0x1UL)            /*!<OV(Bitfield-Mask:0x01)*/
/* ==========================================================  ISR  ========================================================== */
#define BTIMx_ISR_TOP_Pos                        (2UL)            /*!<TOP(Bit2)*/
#define BTIMx_ISR_TOP_Msk                        (0x4UL)            /*!<TOP(Bitfield-Mask:0x01)*/
#define BTIMx_ISR_TI_Pos                         (1UL)            /*!<TI(Bit1)*/
#define BTIMx_ISR_TI_Msk                         (0x2UL)            /*!<TI(Bitfield-Mask:0x01)*/
#define BTIMx_ISR_OV_Pos                         (0UL)            /*!<OV(Bit0)*/
#define BTIMx_ISR_OV_Msk                         (0x1UL)            /*!<OV(Bitfield-Mask:0x01)*/
/* ==========================================================  ICR  ========================================================== */
#define BTIMx_ICR_TOP_Pos                        (2UL)            /*!<TOP(Bit2)*/
#define BTIMx_ICR_TOP_Msk                        (0x4UL)            /*!<TOP(Bitfield-Mask:0x01)*/
#define BTIMx_ICR_TI_Pos                         (1UL)            /*!<TI(Bit1)*/
#define BTIMx_ICR_TI_Msk                         (0x2UL)            /*!<TI(Bitfield-Mask:0x01)*/
#define BTIMx_ICR_OV_Pos                         (0UL)            /*!<OV(Bit0)*/
#define BTIMx_ICR_OV_Msk                         (0x1UL)            /*!<OV(Bitfield-Mask:0x01)*/


/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define CRC_CR_MODE_Pos                          (0UL)            /*!<MODE(Bit0)*/
#define CRC_CR_MODE_Msk                          (0xfUL)            /*!<MODE(Bitfield-Mask:0x0f)*/
/* ==========================================================  DR  =========================================================== */
#define CRC_DR_DR_Pos                            (0UL)            /*!<DR(Bit0)*/
#define CRC_DR_DR_Msk                            (0xffUL)            /*!<DR(Bitfield-Mask:0xff)*/
/* ========================================================  RESULT  ========================================================= */
#define CRC_RESULT_RESULT16_Pos                  (0UL)            /*!<RESULT16(Bit0)*/
#define CRC_RESULT_RESULT16_Msk                  (0x1ffffUL)            /*!<RESULT16(Bitfield-Mask:0x1ffff)*/


/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR1  ========================================================== */
#define FLASH_CR1_KEY_Pos                        (16UL)            /*!<KEY(Bit16)*/
#define FLASH_CR1_KEY_Msk                        (0xffff0000UL)            /*!<KEY(Bitfield-Mask:0xffff)*/
#define FLASH_CR1_SECURITY_Pos                   (6UL)            /*!<SECURITY(Bit6)*/
#define FLASH_CR1_SECURITY_Msk                   (0xc0UL)            /*!<SECURITY(Bitfield-Mask:0x03)*/
#define FLASH_CR1_BUSY_Pos                       (5UL)            /*!<BUSY(Bit5)*/
#define FLASH_CR1_BUSY_Msk                       (0x20UL)            /*!<BUSY(Bitfield-Mask:0x01)*/
#define FLASH_CR1_STANDBY_Pos                    (4UL)            /*!<STANDBY(Bit4)*/
#define FLASH_CR1_STANDBY_Msk                    (0x10UL)            /*!<STANDBY(Bitfield-Mask:0x01)*/
#define FLASH_CR1_MODE_Pos                       (0UL)            /*!<MODE(Bit0)*/
#define FLASH_CR1_MODE_Msk                       (0x3UL)            /*!<MODE(Bitfield-Mask:0x03)*/
/* ==========================================================  CR2  ========================================================== */
#define FLASH_CR2_KEY_Pos                        (16UL)            /*!<KEY(Bit16)*/
#define FLASH_CR2_KEY_Msk                        (0xffff0000UL)            /*!<KEY(Bitfield-Mask:0xffff)*/
#define FLASH_CR2_WAIT_Pos                       (0UL)            /*!<WAIT(Bit0)*/
#define FLASH_CR2_WAIT_Msk                       (0x7UL)            /*!<WAIT(Bitfield-Mask:0x07)*/
/* =======================================================  PAGELOCK  ======================================================== */
#define FLASH_PAGELOCK_KEY_Pos                   (16UL)            /*!<KEY(Bit16)*/
#define FLASH_PAGELOCK_KEY_Msk                   (0xffff0000UL)            /*!<KEY(Bitfield-Mask:0xffff)*/
#define FLASH_PAGELOCK_LOCK9_Pos                 (9UL)            /*!<LOCK9(Bit9)*/
#define FLASH_PAGELOCK_LOCK9_Msk                 (0x200UL)            /*!<LOCK9(Bitfield-Mask:0x01)*/
#define FLASH_PAGELOCK_LOCK8_Pos                 (8UL)            /*!<LOCK8(Bit8)*/
#define FLASH_PAGELOCK_LOCK8_Msk                 (0x100UL)            /*!<LOCK8(Bitfield-Mask:0x01)*/
#define FLASH_PAGELOCK_LOCK7_Pos                 (7UL)            /*!<LOCK7(Bit7)*/
#define FLASH_PAGELOCK_LOCK7_Msk                 (0x80UL)            /*!<LOCK7(Bitfield-Mask:0x01)*/
#define FLASH_PAGELOCK_LOCK6_Pos                 (6UL)            /*!<LOCK6(Bit6)*/
#define FLASH_PAGELOCK_LOCK6_Msk                 (0x40UL)            /*!<LOCK6(Bitfield-Mask:0x01)*/
#define FLASH_PAGELOCK_LOCK5_Pos                 (5UL)            /*!<LOCK5(Bit5)*/
#define FLASH_PAGELOCK_LOCK5_Msk                 (0x20UL)            /*!<LOCK5(Bitfield-Mask:0x01)*/
#define FLASH_PAGELOCK_LOCK4_Pos                 (4UL)            /*!<LOCK4(Bit4)*/
#define FLASH_PAGELOCK_LOCK4_Msk                 (0x10UL)            /*!<LOCK4(Bitfield-Mask:0x01)*/
#define FLASH_PAGELOCK_LOCK3_Pos                 (3UL)            /*!<LOCK3(Bit3)*/
#define FLASH_PAGELOCK_LOCK3_Msk                 (0x8UL)            /*!<LOCK3(Bitfield-Mask:0x01)*/
#define FLASH_PAGELOCK_LOCK2_Pos                 (2UL)            /*!<LOCK2(Bit2)*/
#define FLASH_PAGELOCK_LOCK2_Msk                 (0x4UL)            /*!<LOCK2(Bitfield-Mask:0x01)*/
#define FLASH_PAGELOCK_LOCK1_Pos                 (1UL)            /*!<LOCK1(Bit1)*/
#define FLASH_PAGELOCK_LOCK1_Msk                 (0x2UL)            /*!<LOCK1(Bitfield-Mask:0x01)*/
#define FLASH_PAGELOCK_LOCK0_Pos                 (0UL)            /*!<LOCK0(Bit0)*/
#define FLASH_PAGELOCK_LOCK0_Msk                 (0x1UL)            /*!<LOCK0(Bitfield-Mask:0x01)*/
/* ==========================================================  IER  ========================================================== */
#define FLASH_IER_PROG_Pos                       (4UL)            /*!<PROG(Bit4)*/
#define FLASH_IER_PROG_Msk                       (0x10UL)            /*!<PROG(Bitfield-Mask:0x01)*/
#define FLASH_IER_PAGELOCK_Pos                   (1UL)            /*!<PAGELOCK(Bit1)*/
#define FLASH_IER_PAGELOCK_Msk                   (0x2UL)            /*!<PAGELOCK(Bitfield-Mask:0x01)*/
#define FLASH_IER_PC_Pos                         (0UL)            /*!<PC(Bit0)*/
#define FLASH_IER_PC_Msk                         (0x1UL)            /*!<PC(Bitfield-Mask:0x01)*/
/* ==========================================================  ISR  ========================================================== */
#define FLASH_ISR_PROG_Pos                       (4UL)            /*!<PROG(Bit4)*/
#define FLASH_ISR_PROG_Msk                       (0x10UL)            /*!<PROG(Bitfield-Mask:0x01)*/
#define FLASH_ISR_PAGELOCK_Pos                   (1UL)            /*!<PAGELOCK(Bit1)*/
#define FLASH_ISR_PAGELOCK_Msk                   (0x2UL)            /*!<PAGELOCK(Bitfield-Mask:0x01)*/
#define FLASH_ISR_PC_Pos                         (0UL)            /*!<PC(Bit0)*/
#define FLASH_ISR_PC_Msk                         (0x1UL)            /*!<PC(Bitfield-Mask:0x01)*/
/* ==========================================================  ICR  ========================================================== */
#define FLASH_ICR_PROG_Pos                       (4UL)            /*!<PROG(Bit4)*/
#define FLASH_ICR_PROG_Msk                       (0x10UL)            /*!<PROG(Bitfield-Mask:0x01)*/
#define FLASH_ICR_PAGELOCK_Pos                   (1UL)            /*!<PAGELOCK(Bit1)*/
#define FLASH_ICR_PAGELOCK_Msk                   (0x2UL)            /*!<PAGELOCK(Bitfield-Mask:0x01)*/
#define FLASH_ICR_PC_Pos                         (0UL)            /*!<PC(Bit0)*/
#define FLASH_ICR_PC_Msk                         (0x1UL)            /*!<PC(Bitfield-Mask:0x01)*/


/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */

