21mw12/CW32_Voltammeter/电压电流表资料/数据手册及标准库资料/CW32F003_StandardPeripheralLib_V1.5/Libraries/inc/cw32f003.h
/* ==========================================================  DIR  ========================================================== */
#define GPIOx_DIR_PIN7_Pos                       (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_DIR_PIN7_Msk                       (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_DIR_PIN6_Pos                       (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_DIR_PIN6_Msk                       (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_DIR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_DIR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_DIR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_DIR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_DIR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_DIR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_DIR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_DIR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_DIR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_DIR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_DIR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_DIR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* =======================================================  OPENDRAIN  ======================================================= */
#define GPIOx_OPENDRAIN_PIN7_Pos                 (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_OPENDRAIN_PIN7_Msk                 (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_OPENDRAIN_PIN6_Pos                 (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_OPENDRAIN_PIN6_Msk                 (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_OPENDRAIN_PIN5_Pos                 (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_OPENDRAIN_PIN5_Msk                 (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_OPENDRAIN_PIN4_Pos                 (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_OPENDRAIN_PIN4_Msk                 (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_OPENDRAIN_PIN3_Pos                 (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_OPENDRAIN_PIN3_Msk                 (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_OPENDRAIN_PIN2_Pos                 (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_OPENDRAIN_PIN2_Msk                 (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_OPENDRAIN_PIN1_Pos                 (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_OPENDRAIN_PIN1_Msk                 (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_OPENDRAIN_PIN0_Pos                 (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_OPENDRAIN_PIN0_Msk                 (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  PDR  ========================================================== */
#define GPIOx_PDR_PIN7_Pos                       (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_PDR_PIN7_Msk                       (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_PDR_PIN6_Pos                       (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_PDR_PIN6_Msk                       (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_PDR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_PDR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_PDR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_PDR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_PDR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_PDR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_PDR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_PDR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_PDR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_PDR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_PDR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_PDR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  PUR  ========================================================== */
#define GPIOx_PUR_PIN7_Pos                       (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_PUR_PIN7_Msk                       (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_PUR_PIN6_Pos                       (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_PUR_PIN6_Msk                       (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_PUR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_PUR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_PUR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_PUR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_PUR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_PUR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_PUR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_PUR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_PUR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_PUR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_PUR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_PUR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* =========================================================  AFRL  ========================================================== */
#define GPIOx_AFRL_AFR7_Pos                      (28UL)            /*!<AFR7(Bit28)*/
#define GPIOx_AFRL_AFR7_Msk                      (0x70000000UL)            /*!<AFR7(Bitfield-Mask:0x07)*/
#define GPIOx_AFRL_AFR6_Pos                      (24UL)            /*!<AFR6(Bit24)*/
#define GPIOx_AFRL_AFR6_Msk                      (0x7000000UL)            /*!<AFR6(Bitfield-Mask:0x07)*/
#define GPIOx_AFRL_AFR5_Pos                      (20UL)            /*!<AFR5(Bit20)*/
#define GPIOx_AFRL_AFR5_Msk                      (0x700000UL)            /*!<AFR5(Bitfield-Mask:0x07)*/
#define GPIOx_AFRL_AFR4_Pos                      (16UL)            /*!<AFR4(Bit16)*/
#define GPIOx_AFRL_AFR4_Msk                      (0x70000UL)            /*!<AFR4(Bitfield-Mask:0x07)*/
#define GPIOx_AFRL_AFR3_Pos                      (12UL)            /*!<AFR3(Bit12)*/
#define GPIOx_AFRL_AFR3_Msk                      (0x7000UL)            /*!<AFR3(Bitfield-Mask:0x07)*/
#define GPIOx_AFRL_AFR2_Pos                      (8UL)            /*!<AFR2(Bit8)*/
#define GPIOx_AFRL_AFR2_Msk                      (0x700UL)            /*!<AFR2(Bitfield-Mask:0x07)*/
#define GPIOx_AFRL_AFR1_Pos                      (4UL)            /*!<AFR1(Bit4)*/
#define GPIOx_AFRL_AFR1_Msk                      (0x70UL)            /*!<AFR1(Bitfield-Mask:0x07)*/
#define GPIOx_AFRL_AFR0_Pos                      (0UL)            /*!<AFR0(Bit0)*/
#define GPIOx_AFRL_AFR0_Msk                      (0x7UL)            /*!<AFR0(Bitfield-Mask:0x07)*/
/* ========================================================  ANALOG  ========================================================= */
#define GPIOx_ANALOG_PIN7_Pos                    (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_ANALOG_PIN7_Msk                    (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_ANALOG_PIN6_Pos                    (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_ANALOG_PIN6_Msk                    (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_ANALOG_PIN5_Pos                    (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_ANALOG_PIN5_Msk                    (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_ANALOG_PIN4_Pos                    (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_ANALOG_PIN4_Msk                    (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_ANALOG_PIN3_Pos                    (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_ANALOG_PIN3_Msk                    (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_ANALOG_PIN2_Pos                    (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_ANALOG_PIN2_Msk                    (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_ANALOG_PIN1_Pos                    (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_ANALOG_PIN1_Msk                    (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_ANALOG_PIN0_Pos                    (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_ANALOG_PIN0_Msk                    (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ========================================================  RISEIE  ========================================================= */
#define GPIOx_RISEIE_PIN7_Pos                    (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_RISEIE_PIN7_Msk                    (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_RISEIE_PIN6_Pos                    (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_RISEIE_PIN6_Msk                    (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_RISEIE_PIN5_Pos                    (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_RISEIE_PIN5_Msk                    (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_RISEIE_PIN4_Pos                    (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_RISEIE_PIN4_Msk                    (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_RISEIE_PIN3_Pos                    (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_RISEIE_PIN3_Msk                    (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_RISEIE_PIN2_Pos                    (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_RISEIE_PIN2_Msk                    (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_RISEIE_PIN1_Pos                    (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_RISEIE_PIN1_Msk                    (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_RISEIE_PIN0_Pos                    (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_RISEIE_PIN0_Msk                    (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ========================================================  FALLIE  ========================================================= */
#define GPIOx_FALLIE_PIN7_Pos                    (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_FALLIE_PIN7_Msk                    (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_FALLIE_PIN6_Pos                    (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_FALLIE_PIN6_Msk                    (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_FALLIE_PIN5_Pos                    (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_FALLIE_PIN5_Msk                    (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_FALLIE_PIN4_Pos                    (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_FALLIE_PIN4_Msk                    (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_FALLIE_PIN3_Pos                    (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_FALLIE_PIN3_Msk                    (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_FALLIE_PIN2_Pos                    (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_FALLIE_PIN2_Msk                    (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_FALLIE_PIN1_Pos                    (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_FALLIE_PIN1_Msk                    (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_FALLIE_PIN0_Pos                    (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_FALLIE_PIN0_Msk                    (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ========================================================  HIGHIE  ========================================================= */
#define GPIOx_HIGHIE_PIN7_Pos                    (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_HIGHIE_PIN7_Msk                    (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_HIGHIE_PIN6_Pos                    (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_HIGHIE_PIN6_Msk                    (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_HIGHIE_PIN5_Pos                    (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_HIGHIE_PIN5_Msk                    (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_HIGHIE_PIN4_Pos                    (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_HIGHIE_PIN4_Msk                    (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_HIGHIE_PIN3_Pos                    (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_HIGHIE_PIN3_Msk                    (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_HIGHIE_PIN2_Pos                    (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_HIGHIE_PIN2_Msk                    (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_HIGHIE_PIN1_Pos                    (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_HIGHIE_PIN1_Msk                    (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_HIGHIE_PIN0_Pos                    (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_HIGHIE_PIN0_Msk                    (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* =========================================================  LOWIE  ========================================================= */
#define GPIOx_LOWIE_PIN7_Pos                     (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_LOWIE_PIN7_Msk                     (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_LOWIE_PIN6_Pos                     (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_LOWIE_PIN6_Msk                     (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_LOWIE_PIN5_Pos                     (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_LOWIE_PIN5_Msk                     (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_LOWIE_PIN4_Pos                     (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_LOWIE_PIN4_Msk                     (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_LOWIE_PIN3_Pos                     (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_LOWIE_PIN3_Msk                     (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_LOWIE_PIN2_Pos                     (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_LOWIE_PIN2_Msk                     (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_LOWIE_PIN1_Pos                     (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_LOWIE_PIN1_Msk                     (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_LOWIE_PIN0_Pos                     (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_LOWIE_PIN0_Msk                     (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  ISR  ========================================================== */
#define GPIOx_ISR_PIN7_Pos                       (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_ISR_PIN7_Msk                       (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_ISR_PIN6_Pos                       (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_ISR_PIN6_Msk                       (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_ISR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_ISR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_ISR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_ISR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_ISR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_ISR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_ISR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_ISR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_ISR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_ISR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_ISR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_ISR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  ICR  ========================================================== */
#define GPIOx_ICR_PIN7_Pos                       (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_ICR_PIN7_Msk                       (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_ICR_PIN6_Pos                       (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_ICR_PIN6_Msk                       (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_ICR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_ICR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_ICR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_ICR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_ICR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_ICR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_ICR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_ICR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_ICR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_ICR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_ICR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_ICR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ========================================================  FILTER  ========================================================= */
#define GPIOx_FILTER_FLTCLK_Pos                  (16UL)            /*!<FLTCLK(Bit16)*/
#define GPIOx_FILTER_FLTCLK_Msk                  (0x70000UL)            /*!<FLTCLK(Bitfield-Mask:0x07)*/
#define GPIOx_FILTER_PIN7_Pos                    (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_FILTER_PIN7_Msk                    (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_FILTER_PIN6_Pos                    (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_FILTER_PIN6_Msk                    (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_FILTER_PIN5_Pos                    (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_FILTER_PIN5_Msk                    (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_FILTER_PIN4_Pos                    (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_FILTER_PIN4_Msk                    (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_FILTER_PIN3_Pos                    (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_FILTER_PIN3_Msk                    (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_FILTER_PIN2_Pos                    (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_FILTER_PIN2_Msk                    (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_FILTER_PIN1_Pos                    (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_FILTER_PIN1_Msk                    (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_FILTER_PIN0_Pos                    (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_FILTER_PIN0_Msk                    (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  IDR  ========================================================== */
#define GPIOx_IDR_PIN7_Pos                       (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_IDR_PIN7_Msk                       (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_IDR_PIN6_Pos                       (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_IDR_PIN6_Msk                       (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_IDR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_IDR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_IDR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_IDR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_IDR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_IDR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_IDR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_IDR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_IDR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_IDR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_IDR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_IDR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  ODR  ========================================================== */
#define GPIOx_ODR_PIN7_Pos                       (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_ODR_PIN7_Msk                       (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_ODR_PIN6_Pos                       (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_ODR_PIN6_Msk                       (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_ODR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_ODR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_ODR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_ODR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_ODR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_ODR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_ODR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_ODR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
