21mw12/CW32_Voltammeter/电压电流表资料/数据手册及标准库资料/CW32F003_StandardPeripheralLib_V1.5/Libraries/inc/cw32f003.h
#define GPIOx_ODR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_ODR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_ODR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_ODR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  BRR  ========================================================== */
#define GPIOx_BRR_BRR7_Pos                       (7UL)            /*!<BRR7(Bit7)*/
#define GPIOx_BRR_BRR7_Msk                       (0x80UL)            /*!<BRR7(Bitfield-Mask:0x01)*/
#define GPIOx_BRR_BRR6_Pos                       (6UL)            /*!<BRR6(Bit6)*/
#define GPIOx_BRR_BRR6_Msk                       (0x40UL)            /*!<BRR6(Bitfield-Mask:0x01)*/
#define GPIOx_BRR_BRR5_Pos                       (5UL)            /*!<BRR5(Bit5)*/
#define GPIOx_BRR_BRR5_Msk                       (0x20UL)            /*!<BRR5(Bitfield-Mask:0x01)*/
#define GPIOx_BRR_BRR4_Pos                       (4UL)            /*!<BRR4(Bit4)*/
#define GPIOx_BRR_BRR4_Msk                       (0x10UL)            /*!<BRR4(Bitfield-Mask:0x01)*/
#define GPIOx_BRR_BRR3_Pos                       (3UL)            /*!<BRR3(Bit3)*/
#define GPIOx_BRR_BRR3_Msk                       (0x8UL)            /*!<BRR3(Bitfield-Mask:0x01)*/
#define GPIOx_BRR_BRR2_Pos                       (2UL)            /*!<BRR2(Bit2)*/
#define GPIOx_BRR_BRR2_Msk                       (0x4UL)            /*!<BRR2(Bitfield-Mask:0x01)*/
#define GPIOx_BRR_BRR1_Pos                       (1UL)            /*!<BRR1(Bit1)*/
#define GPIOx_BRR_BRR1_Msk                       (0x2UL)            /*!<BRR1(Bitfield-Mask:0x01)*/
#define GPIOx_BRR_BRR0_Pos                       (0UL)            /*!<BRR0(Bit0)*/
#define GPIOx_BRR_BRR0_Msk                       (0x1UL)            /*!<BRR0(Bitfield-Mask:0x01)*/
/* =========================================================  BSRR  ========================================================== */
#define GPIOx_BSRR_BRR7_Pos                      (23UL)            /*!<BRR7(Bit23)*/
#define GPIOx_BSRR_BRR7_Msk                      (0x800000UL)            /*!<BRR7(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BRR6_Pos                      (22UL)            /*!<BRR6(Bit22)*/
#define GPIOx_BSRR_BRR6_Msk                      (0x400000UL)            /*!<BRR6(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BRR5_Pos                      (21UL)            /*!<BRR5(Bit21)*/
#define GPIOx_BSRR_BRR5_Msk                      (0x200000UL)            /*!<BRR5(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BRR4_Pos                      (20UL)            /*!<BRR4(Bit20)*/
#define GPIOx_BSRR_BRR4_Msk                      (0x100000UL)            /*!<BRR4(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BRR3_Pos                      (19UL)            /*!<BRR3(Bit19)*/
#define GPIOx_BSRR_BRR3_Msk                      (0x80000UL)            /*!<BRR3(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BRR2_Pos                      (18UL)            /*!<BRR2(Bit18)*/
#define GPIOx_BSRR_BRR2_Msk                      (0x40000UL)            /*!<BRR2(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BRR1_Pos                      (17UL)            /*!<BRR1(Bit17)*/
#define GPIOx_BSRR_BRR1_Msk                      (0x20000UL)            /*!<BRR1(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BRR0_Pos                      (16UL)            /*!<BRR0(Bit16)*/
#define GPIOx_BSRR_BRR0_Msk                      (0x10000UL)            /*!<BRR0(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BSS7_Pos                      (7UL)            /*!<BSS7(Bit7)*/
#define GPIOx_BSRR_BSS7_Msk                      (0x80UL)            /*!<BSS7(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BSS6_Pos                      (6UL)            /*!<BSS6(Bit6)*/
#define GPIOx_BSRR_BSS6_Msk                      (0x40UL)            /*!<BSS6(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BSS5_Pos                      (5UL)            /*!<BSS5(Bit5)*/
#define GPIOx_BSRR_BSS5_Msk                      (0x20UL)            /*!<BSS5(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BSS4_Pos                      (4UL)            /*!<BSS4(Bit4)*/
#define GPIOx_BSRR_BSS4_Msk                      (0x10UL)            /*!<BSS4(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BSS3_Pos                      (3UL)            /*!<BSS3(Bit3)*/
#define GPIOx_BSRR_BSS3_Msk                      (0x8UL)            /*!<BSS3(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BSS2_Pos                      (2UL)            /*!<BSS2(Bit2)*/
#define GPIOx_BSRR_BSS2_Msk                      (0x4UL)            /*!<BSS2(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BSS1_Pos                      (1UL)            /*!<BSS1(Bit1)*/
#define GPIOx_BSRR_BSS1_Msk                      (0x2UL)            /*!<BSS1(Bitfield-Mask:0x01)*/
#define GPIOx_BSRR_BSS0_Pos                      (0UL)            /*!<BSS0(Bit0)*/
#define GPIOx_BSRR_BSS0_Msk                      (0x1UL)            /*!<BSS0(Bitfield-Mask:0x01)*/
/* ==========================================================  TOG  ========================================================== */
#define GPIOx_TOG_PIN7_Pos                       (7UL)            /*!<PIN7(Bit7)*/
#define GPIOx_TOG_PIN7_Msk                       (0x80UL)            /*!<PIN7(Bitfield-Mask:0x01)*/
#define GPIOx_TOG_PIN6_Pos                       (6UL)            /*!<PIN6(Bit6)*/
#define GPIOx_TOG_PIN6_Msk                       (0x40UL)            /*!<PIN6(Bitfield-Mask:0x01)*/
#define GPIOx_TOG_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOx_TOG_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOx_TOG_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOx_TOG_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOx_TOG_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOx_TOG_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOx_TOG_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOx_TOG_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOx_TOG_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOx_TOG_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOx_TOG_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOx_TOG_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/


/* =========================================================================================================================== */
/* ================                                           GPIOC                                           ================ */
/* =========================================================================================================================== */

