21mw12/CW32_Voltammeter/电压电流表资料/数据手册及标准库资料/CW32F003_StandardPeripheralLib_V1.5/Libraries/inc/cw32f003.h
/* ==========================================================  DIR  ========================================================== */
#define GPIOC_DIR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_DIR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_DIR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_DIR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_DIR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_DIR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_DIR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_DIR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_DIR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_DIR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_DIR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_DIR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* =======================================================  OPENDRAIN  ======================================================= */
#define GPIOC_OPENDRAIN_PIN5_Pos                 (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_OPENDRAIN_PIN5_Msk                 (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_OPENDRAIN_PIN4_Pos                 (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_OPENDRAIN_PIN4_Msk                 (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_OPENDRAIN_PIN3_Pos                 (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_OPENDRAIN_PIN3_Msk                 (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_OPENDRAIN_PIN2_Pos                 (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_OPENDRAIN_PIN2_Msk                 (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_OPENDRAIN_PIN1_Pos                 (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_OPENDRAIN_PIN1_Msk                 (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_OPENDRAIN_PIN0_Pos                 (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_OPENDRAIN_PIN0_Msk                 (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  PDR  ========================================================== */
#define GPIOC_PDR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_PDR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_PDR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_PDR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_PDR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_PDR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_PDR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_PDR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_PDR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_PDR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_PDR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_PDR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  PUR  ========================================================== */
#define GPIOC_PUR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_PUR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_PUR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_PUR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_PUR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_PUR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_PUR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_PUR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_PUR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_PUR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_PUR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_PUR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* =========================================================  AFRL  ========================================================== */
#define GPIOC_AFRL_AFR5_Pos                      (20UL)            /*!<AFR5(Bit20)*/
#define GPIOC_AFRL_AFR5_Msk                      (0x700000UL)            /*!<AFR5(Bitfield-Mask:0x07)*/
#define GPIOC_AFRL_AFR4_Pos                      (16UL)            /*!<AFR4(Bit16)*/
#define GPIOC_AFRL_AFR4_Msk                      (0x70000UL)            /*!<AFR4(Bitfield-Mask:0x07)*/
#define GPIOC_AFRL_AFR3_Pos                      (12UL)            /*!<AFR3(Bit12)*/
#define GPIOC_AFRL_AFR3_Msk                      (0x7000UL)            /*!<AFR3(Bitfield-Mask:0x07)*/
#define GPIOC_AFRL_AFR2_Pos                      (8UL)            /*!<AFR2(Bit8)*/
#define GPIOC_AFRL_AFR2_Msk                      (0x700UL)            /*!<AFR2(Bitfield-Mask:0x07)*/
#define GPIOC_AFRL_AFR1_Pos                      (4UL)            /*!<AFR1(Bit4)*/
#define GPIOC_AFRL_AFR1_Msk                      (0x70UL)            /*!<AFR1(Bitfield-Mask:0x07)*/
#define GPIOC_AFRL_AFR0_Pos                      (0UL)            /*!<AFR0(Bit0)*/
#define GPIOC_AFRL_AFR0_Msk                      (0x7UL)            /*!<AFR0(Bitfield-Mask:0x07)*/
/* ========================================================  ANALOG  ========================================================= */
#define GPIOC_ANALOG_PIN5_Pos                    (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_ANALOG_PIN5_Msk                    (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_ANALOG_PIN4_Pos                    (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_ANALOG_PIN4_Msk                    (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_ANALOG_PIN3_Pos                    (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_ANALOG_PIN3_Msk                    (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_ANALOG_PIN2_Pos                    (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_ANALOG_PIN2_Msk                    (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_ANALOG_PIN1_Pos                    (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_ANALOG_PIN1_Msk                    (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_ANALOG_PIN0_Pos                    (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_ANALOG_PIN0_Msk                    (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ========================================================  RISEIE  ========================================================= */
#define GPIOC_RISEIE_PIN5_Pos                    (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_RISEIE_PIN5_Msk                    (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_RISEIE_PIN4_Pos                    (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_RISEIE_PIN4_Msk                    (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_RISEIE_PIN3_Pos                    (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_RISEIE_PIN3_Msk                    (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_RISEIE_PIN2_Pos                    (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_RISEIE_PIN2_Msk                    (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_RISEIE_PIN1_Pos                    (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_RISEIE_PIN1_Msk                    (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_RISEIE_PIN0_Pos                    (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_RISEIE_PIN0_Msk                    (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ========================================================  FALLIE  ========================================================= */
#define GPIOC_FALLIE_PIN5_Pos                    (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_FALLIE_PIN5_Msk                    (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_FALLIE_PIN4_Pos                    (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_FALLIE_PIN4_Msk                    (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_FALLIE_PIN3_Pos                    (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_FALLIE_PIN3_Msk                    (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_FALLIE_PIN2_Pos                    (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_FALLIE_PIN2_Msk                    (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_FALLIE_PIN1_Pos                    (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_FALLIE_PIN1_Msk                    (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_FALLIE_PIN0_Pos                    (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_FALLIE_PIN0_Msk                    (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ========================================================  HIGHIE  ========================================================= */
#define GPIOC_HIGHIE_PIN5_Pos                    (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_HIGHIE_PIN5_Msk                    (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_HIGHIE_PIN4_Pos                    (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_HIGHIE_PIN4_Msk                    (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_HIGHIE_PIN3_Pos                    (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_HIGHIE_PIN3_Msk                    (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_HIGHIE_PIN2_Pos                    (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_HIGHIE_PIN2_Msk                    (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_HIGHIE_PIN1_Pos                    (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_HIGHIE_PIN1_Msk                    (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_HIGHIE_PIN0_Pos                    (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_HIGHIE_PIN0_Msk                    (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* =========================================================  LOWIE  ========================================================= */
#define GPIOC_LOWIE_PIN5_Pos                     (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_LOWIE_PIN5_Msk                     (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_LOWIE_PIN4_Pos                     (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_LOWIE_PIN4_Msk                     (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_LOWIE_PIN3_Pos                     (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_LOWIE_PIN3_Msk                     (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_LOWIE_PIN2_Pos                     (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_LOWIE_PIN2_Msk                     (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_LOWIE_PIN1_Pos                     (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_LOWIE_PIN1_Msk                     (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_LOWIE_PIN0_Pos                     (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_LOWIE_PIN0_Msk                     (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  ISR  ========================================================== */
#define GPIOC_ISR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_ISR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_ISR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_ISR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_ISR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_ISR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_ISR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_ISR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_ISR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_ISR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_ISR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_ISR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  ICR  ========================================================== */
#define GPIOC_ICR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_ICR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_ICR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_ICR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_ICR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_ICR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_ICR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_ICR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_ICR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_ICR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_ICR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_ICR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ========================================================  FILTER  ========================================================= */
#define GPIOC_FILTER_FLTCLK_Pos                  (16UL)            /*!<FLTCLK(Bit16)*/
#define GPIOC_FILTER_FLTCLK_Msk                  (0x70000UL)            /*!<FLTCLK(Bitfield-Mask:0x07)*/
#define GPIOC_FILTER_PIN5_Pos                    (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_FILTER_PIN5_Msk                    (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_FILTER_PIN4_Pos                    (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_FILTER_PIN4_Msk                    (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_FILTER_PIN3_Pos                    (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_FILTER_PIN3_Msk                    (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_FILTER_PIN2_Pos                    (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_FILTER_PIN2_Msk                    (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_FILTER_PIN1_Pos                    (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_FILTER_PIN1_Msk                    (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_FILTER_PIN0_Pos                    (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_FILTER_PIN0_Msk                    (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  IDR  ========================================================== */
#define GPIOC_IDR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_IDR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_IDR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_IDR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_IDR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_IDR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_IDR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_IDR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_IDR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_IDR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_IDR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_IDR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  ODR  ========================================================== */
#define GPIOC_ODR_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_ODR_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_ODR_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_ODR_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_ODR_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_ODR_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_ODR_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_ODR_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_ODR_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_ODR_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_ODR_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_ODR_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/
/* ==========================================================  BRR  ========================================================== */
#define GPIOC_BRR_BRR5_Pos                       (5UL)            /*!<BRR5(Bit5)*/
#define GPIOC_BRR_BRR5_Msk                       (0x20UL)            /*!<BRR5(Bitfield-Mask:0x01)*/
#define GPIOC_BRR_BRR4_Pos                       (4UL)            /*!<BRR4(Bit4)*/
#define GPIOC_BRR_BRR4_Msk                       (0x10UL)            /*!<BRR4(Bitfield-Mask:0x01)*/
#define GPIOC_BRR_BRR3_Pos                       (3UL)            /*!<BRR3(Bit3)*/
#define GPIOC_BRR_BRR3_Msk                       (0x8UL)            /*!<BRR3(Bitfield-Mask:0x01)*/
#define GPIOC_BRR_BRR2_Pos                       (2UL)            /*!<BRR2(Bit2)*/
#define GPIOC_BRR_BRR2_Msk                       (0x4UL)            /*!<BRR2(Bitfield-Mask:0x01)*/
#define GPIOC_BRR_BRR1_Pos                       (1UL)            /*!<BRR1(Bit1)*/
#define GPIOC_BRR_BRR1_Msk                       (0x2UL)            /*!<BRR1(Bitfield-Mask:0x01)*/
#define GPIOC_BRR_BRR0_Pos                       (0UL)            /*!<BRR0(Bit0)*/
#define GPIOC_BRR_BRR0_Msk                       (0x1UL)            /*!<BRR0(Bitfield-Mask:0x01)*/
/* =========================================================  BSRR  ========================================================== */
#define GPIOC_BSRR_BRR5_Pos                      (21UL)            /*!<BRR5(Bit21)*/
#define GPIOC_BSRR_BRR5_Msk                      (0x200000UL)            /*!<BRR5(Bitfield-Mask:0x01)*/
#define GPIOC_BSRR_BRR4_Pos                      (20UL)            /*!<BRR4(Bit20)*/
#define GPIOC_BSRR_BRR4_Msk                      (0x100000UL)            /*!<BRR4(Bitfield-Mask:0x01)*/
#define GPIOC_BSRR_BRR3_Pos                      (19UL)            /*!<BRR3(Bit19)*/
#define GPIOC_BSRR_BRR3_Msk                      (0x80000UL)            /*!<BRR3(Bitfield-Mask:0x01)*/
#define GPIOC_BSRR_BRR2_Pos                      (18UL)            /*!<BRR2(Bit18)*/
#define GPIOC_BSRR_BRR2_Msk                      (0x40000UL)            /*!<BRR2(Bitfield-Mask:0x01)*/
#define GPIOC_BSRR_BRR1_Pos                      (17UL)            /*!<BRR1(Bit17)*/
#define GPIOC_BSRR_BRR1_Msk                      (0x20000UL)            /*!<BRR1(Bitfield-Mask:0x01)*/
#define GPIOC_BSRR_BRR0_Pos                      (16UL)            /*!<BRR0(Bit16)*/
#define GPIOC_BSRR_BRR0_Msk                      (0x10000UL)            /*!<BRR0(Bitfield-Mask:0x01)*/
#define GPIOC_BSRR_BSS5_Pos                      (5UL)            /*!<BSS5(Bit5)*/
#define GPIOC_BSRR_BSS5_Msk                      (0x20UL)            /*!<BSS5(Bitfield-Mask:0x01)*/
#define GPIOC_BSRR_BSS4_Pos                      (4UL)            /*!<BSS4(Bit4)*/
#define GPIOC_BSRR_BSS4_Msk                      (0x10UL)            /*!<BSS4(Bitfield-Mask:0x01)*/
#define GPIOC_BSRR_BSS3_Pos                      (3UL)            /*!<BSS3(Bit3)*/
#define GPIOC_BSRR_BSS3_Msk                      (0x8UL)            /*!<BSS3(Bitfield-Mask:0x01)*/
#define GPIOC_BSRR_BSS2_Pos                      (2UL)            /*!<BSS2(Bit2)*/
#define GPIOC_BSRR_BSS2_Msk                      (0x4UL)            /*!<BSS2(Bitfield-Mask:0x01)*/
#define GPIOC_BSRR_BSS1_Pos                      (1UL)            /*!<BSS1(Bit1)*/
#define GPIOC_BSRR_BSS1_Msk                      (0x2UL)            /*!<BSS1(Bitfield-Mask:0x01)*/
#define GPIOC_BSRR_BSS0_Pos                      (0UL)            /*!<BSS0(Bit0)*/
#define GPIOC_BSRR_BSS0_Msk                      (0x1UL)            /*!<BSS0(Bitfield-Mask:0x01)*/
/* ==========================================================  TOG  ========================================================== */
#define GPIOC_TOG_PIN5_Pos                       (5UL)            /*!<PIN5(Bit5)*/
#define GPIOC_TOG_PIN5_Msk                       (0x20UL)            /*!<PIN5(Bitfield-Mask:0x01)*/
#define GPIOC_TOG_PIN4_Pos                       (4UL)            /*!<PIN4(Bit4)*/
#define GPIOC_TOG_PIN4_Msk                       (0x10UL)            /*!<PIN4(Bitfield-Mask:0x01)*/
#define GPIOC_TOG_PIN3_Pos                       (3UL)            /*!<PIN3(Bit3)*/
#define GPIOC_TOG_PIN3_Msk                       (0x8UL)            /*!<PIN3(Bitfield-Mask:0x01)*/
#define GPIOC_TOG_PIN2_Pos                       (2UL)            /*!<PIN2(Bit2)*/
#define GPIOC_TOG_PIN2_Msk                       (0x4UL)            /*!<PIN2(Bitfield-Mask:0x01)*/
#define GPIOC_TOG_PIN1_Pos                       (1UL)            /*!<PIN1(Bit1)*/
#define GPIOC_TOG_PIN1_Msk                       (0x2UL)            /*!<PIN1(Bitfield-Mask:0x01)*/
#define GPIOC_TOG_PIN0_Pos                       (0UL)            /*!<PIN0(Bit0)*/
#define GPIOC_TOG_PIN0_Msk                       (0x1UL)            /*!<PIN0(Bitfield-Mask:0x01)*/


