21mw12/CW32_Voltammeter/电压电流表资料/数据手册及标准库资料/CW32F003_StandardPeripheralLib_V1.5/Libraries/inc/cw32f003.h
/* =========================================================================================================================== */
/* ================                                           GTIM                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  ARR  ========================================================== */
#define GTIM_ARR_ARR_Pos                         (0UL)            /*!<ARR(Bit0)*/
#define GTIM_ARR_ARR_Msk                         (0xffffUL)            /*!<ARR(Bitfield-Mask:0xffff)*/
/* ==========================================================  CNT  ========================================================== */
#define GTIM_CNT_CNT_Pos                         (0UL)            /*!<CNT(Bit0)*/
#define GTIM_CNT_CNT_Msk                         (0xffffUL)            /*!<CNT(Bitfield-Mask:0xffff)*/
/* =========================================================  CMMR  ========================================================== */
#define GTIM_CMMR_CC4M_Pos                       (12UL)            /*!<CC4M(Bit12)*/
#define GTIM_CMMR_CC4M_Msk                       (0xf000UL)            /*!<CC4M(Bitfield-Mask:0x0f)*/
#define GTIM_CMMR_CC3M_Pos                       (8UL)            /*!<CC3M(Bit8)*/
#define GTIM_CMMR_CC3M_Msk                       (0xf00UL)            /*!<CC3M(Bitfield-Mask:0x0f)*/
#define GTIM_CMMR_CC2M_Pos                       (4UL)            /*!<CC2M(Bit4)*/
#define GTIM_CMMR_CC2M_Msk                       (0xf0UL)            /*!<CC2M(Bitfield-Mask:0x0f)*/
#define GTIM_CMMR_CC1M_Pos                       (0UL)            /*!<CC1M(Bit0)*/
#define GTIM_CMMR_CC1M_Msk                       (0xfUL)            /*!<CC1M(Bitfield-Mask:0x0f)*/
/* ==========================================================  ETR  ========================================================== */
#define GTIM_ETR_ETRFLT_Pos                      (4UL)            /*!<ETRFLT(Bit4)*/
#define GTIM_ETR_ETRFLT_Msk                      (0x70UL)            /*!<ETRFLT(Bitfield-Mask:0x07)*/
/* ==========================================================  CR0  ========================================================== */
#define GTIM_CR0_ENCRELOAD_Pos                   (19UL)            /*!<ENCRELOAD(Bit19)*/
#define GTIM_CR0_ENCRELOAD_Msk                   (0x180000UL)            /*!<ENCRELOAD(Bitfield-Mask:0x03)*/
#define GTIM_CR0_ENCRESET_Pos                    (17UL)            /*!<ENCRESET(Bit17)*/
#define GTIM_CR0_ENCRESET_Msk                    (0x60000UL)            /*!<ENCRESET(Bitfield-Mask:0x03)*/
#define GTIM_CR0_ENCMODE_Pos                     (15UL)            /*!<ENCMODE(Bit15)*/
#define GTIM_CR0_ENCMODE_Msk                     (0x18000UL)            /*!<ENCMODE(Bitfield-Mask:0x03)*/
#define GTIM_CR0_PRSSTATUS_Pos                   (11UL)            /*!<PRSSTATUS(Bit11)*/
#define GTIM_CR0_PRSSTATUS_Msk                   (0x7800UL)            /*!<PRSSTATUS(Bitfield-Mask:0x0f)*/
#define GTIM_CR0_PRS_Pos                         (7UL)            /*!<PRS(Bit7)*/
#define GTIM_CR0_PRS_Msk                         (0x780UL)            /*!<PRS(Bitfield-Mask:0x0f)*/
#define GTIM_CR0_TOGEN_Pos                       (6UL)            /*!<TOGEN(Bit6)*/
#define GTIM_CR0_TOGEN_Msk                       (0x40UL)            /*!<TOGEN(Bitfield-Mask:0x01)*/
#define GTIM_CR0_ONESHOT_Pos                     (5UL)            /*!<ONESHOT(Bit5)*/
#define GTIM_CR0_ONESHOT_Msk                     (0x20UL)            /*!<ONESHOT(Bitfield-Mask:0x01)*/
#define GTIM_CR0_POL_Pos                         (4UL)            /*!<POL(Bit4)*/
#define GTIM_CR0_POL_Msk                         (0x10UL)            /*!<POL(Bitfield-Mask:0x01)*/
#define GTIM_CR0_TRS_Pos                         (3UL)            /*!<TRS(Bit3)*/
#define GTIM_CR0_TRS_Msk                         (0x8UL)            /*!<TRS(Bitfield-Mask:0x01)*/
#define GTIM_CR0_MODE_Pos                        (1UL)            /*!<MODE(Bit1)*/
#define GTIM_CR0_MODE_Msk                        (0x6UL)            /*!<MODE(Bitfield-Mask:0x03)*/
#define GTIM_CR0_EN_Pos                          (0UL)            /*!<EN(Bit0)*/
#define GTIM_CR0_EN_Msk                          (0x1UL)            /*!<EN(Bitfield-Mask:0x01)*/
/* ==========================================================  IER  ========================================================== */
#define GTIM_IER_DIRCHANGE_Pos                   (9UL)            /*!<DIRCHANGE(Bit9)*/
#define GTIM_IER_DIRCHANGE_Msk                   (0x200UL)            /*!<DIRCHANGE(Bitfield-Mask:0x01)*/
#define GTIM_IER_CC4_Pos                         (6UL)            /*!<CC4(Bit6)*/
#define GTIM_IER_CC4_Msk                         (0x40UL)            /*!<CC4(Bitfield-Mask:0x01)*/
#define GTIM_IER_CC3_Pos                         (5UL)            /*!<CC3(Bit5)*/
#define GTIM_IER_CC3_Msk                         (0x20UL)            /*!<CC3(Bitfield-Mask:0x01)*/
#define GTIM_IER_CC2_Pos                         (4UL)            /*!<CC2(Bit4)*/
#define GTIM_IER_CC2_Msk                         (0x10UL)            /*!<CC2(Bitfield-Mask:0x01)*/
#define GTIM_IER_CC1_Pos                         (3UL)            /*!<CC1(Bit3)*/
#define GTIM_IER_CC1_Msk                         (0x8UL)            /*!<CC1(Bitfield-Mask:0x01)*/
#define GTIM_IER_UD_Pos                          (2UL)            /*!<UD(Bit2)*/
#define GTIM_IER_UD_Msk                          (0x4UL)            /*!<UD(Bitfield-Mask:0x01)*/
#define GTIM_IER_TI_Pos                          (1UL)            /*!<TI(Bit1)*/
#define GTIM_IER_TI_Msk                          (0x2UL)            /*!<TI(Bitfield-Mask:0x01)*/
#define GTIM_IER_OV_Pos                          (0UL)            /*!<OV(Bit0)*/
#define GTIM_IER_OV_Msk                          (0x1UL)            /*!<OV(Bitfield-Mask:0x01)*/
/* ==========================================================  ISR  ========================================================== */
#define GTIM_ISR_DIR_Pos                         (10UL)            /*!<DIR(Bit10)*/
#define GTIM_ISR_DIR_Msk                         (0x400UL)            /*!<DIR(Bitfield-Mask:0x01)*/
#define GTIM_ISR_DIRCHANGE_Pos                   (9UL)            /*!<DIRCHANGE(Bit9)*/
#define GTIM_ISR_DIRCHANGE_Msk                   (0x200UL)            /*!<DIRCHANGE(Bitfield-Mask:0x01)*/
#define GTIM_ISR_CC4_Pos                         (6UL)            /*!<CC4(Bit6)*/
#define GTIM_ISR_CC4_Msk                         (0x40UL)            /*!<CC4(Bitfield-Mask:0x01)*/
#define GTIM_ISR_CC3_Pos                         (5UL)            /*!<CC3(Bit5)*/
#define GTIM_ISR_CC3_Msk                         (0x20UL)            /*!<CC3(Bitfield-Mask:0x01)*/
#define GTIM_ISR_CC2_Pos                         (4UL)            /*!<CC2(Bit4)*/
#define GTIM_ISR_CC2_Msk                         (0x10UL)            /*!<CC2(Bitfield-Mask:0x01)*/
#define GTIM_ISR_CC1_Pos                         (3UL)            /*!<CC1(Bit3)*/
#define GTIM_ISR_CC1_Msk                         (0x8UL)            /*!<CC1(Bitfield-Mask:0x01)*/
#define GTIM_ISR_UD_Pos                          (2UL)            /*!<UD(Bit2)*/
#define GTIM_ISR_UD_Msk                          (0x4UL)            /*!<UD(Bitfield-Mask:0x01)*/
#define GTIM_ISR_TI_Pos                          (1UL)            /*!<TI(Bit1)*/
#define GTIM_ISR_TI_Msk                          (0x2UL)            /*!<TI(Bitfield-Mask:0x01)*/
#define GTIM_ISR_OV_Pos                          (0UL)            /*!<OV(Bit0)*/
#define GTIM_ISR_OV_Msk                          (0x1UL)            /*!<OV(Bitfield-Mask:0x01)*/
/* ==========================================================  ICR  ========================================================== */
#define GTIM_ICR_DIRCHANGE_Pos                   (9UL)            /*!<DIRCHANGE(Bit9)*/
#define GTIM_ICR_DIRCHANGE_Msk                   (0x200UL)            /*!<DIRCHANGE(Bitfield-Mask:0x01)*/
#define GTIM_ICR_CC4_Pos                         (6UL)            /*!<CC4(Bit6)*/
#define GTIM_ICR_CC4_Msk                         (0x40UL)            /*!<CC4(Bitfield-Mask:0x01)*/
#define GTIM_ICR_CC3_Pos                         (5UL)            /*!<CC3(Bit5)*/
#define GTIM_ICR_CC3_Msk                         (0x20UL)            /*!<CC3(Bitfield-Mask:0x01)*/
#define GTIM_ICR_CC2_Pos                         (4UL)            /*!<CC2(Bit4)*/
#define GTIM_ICR_CC2_Msk                         (0x10UL)            /*!<CC2(Bitfield-Mask:0x01)*/
#define GTIM_ICR_CC1_Pos                         (3UL)            /*!<CC1(Bit3)*/
#define GTIM_ICR_CC1_Msk                         (0x8UL)            /*!<CC1(Bitfield-Mask:0x01)*/
#define GTIM_ICR_UD_Pos                          (2UL)            /*!<UD(Bit2)*/
#define GTIM_ICR_UD_Msk                          (0x4UL)            /*!<UD(Bitfield-Mask:0x01)*/
#define GTIM_ICR_TI_Pos                          (1UL)            /*!<TI(Bit1)*/
#define GTIM_ICR_TI_Msk                          (0x2UL)            /*!<TI(Bitfield-Mask:0x01)*/
#define GTIM_ICR_OV_Pos                          (0UL)            /*!<OV(Bit0)*/
#define GTIM_ICR_OV_Msk                          (0x1UL)            /*!<OV(Bitfield-Mask:0x01)*/
/* =========================================================  CCR1  ========================================================== */
#define GTIM_CCR1_CCR_Pos                        (0UL)            /*!<CCR(Bit0)*/
#define GTIM_CCR1_CCR_Msk                        (0xffffUL)            /*!<CCR(Bitfield-Mask:0xffff)*/
/* =========================================================  CCR2  ========================================================== */
#define GTIM_CCR2_CCR_Pos                        (0UL)            /*!<CCR(Bit0)*/
#define GTIM_CCR2_CCR_Msk                        (0xffffUL)            /*!<CCR(Bitfield-Mask:0xffff)*/
/* =========================================================  CCR3  ========================================================== */
#define GTIM_CCR3_CCR_Pos                        (0UL)            /*!<CCR(Bit0)*/
#define GTIM_CCR3_CCR_Msk                        (0xffffUL)            /*!<CCR(Bitfield-Mask:0xffff)*/
/* =========================================================  CCR4  ========================================================== */
#define GTIM_CCR4_CCR_Pos                        (0UL)            /*!<CCR(Bit0)*/
#define GTIM_CCR4_CCR_Msk                        (0xffffUL)            /*!<CCR(Bitfield-Mask:0xffff)*/
/* ==========================================================  CR1  ========================================================== */
#define GTIM_CR1_CH4POL_Pos                      (15UL)            /*!<CH4POL(Bit15)*/
#define GTIM_CR1_CH4POL_Msk                      (0x8000UL)            /*!<CH4POL(Bitfield-Mask:0x01)*/
#define GTIM_CR1_CH4FLT_Pos                      (12UL)            /*!<CH4FLT(Bit12)*/
#define GTIM_CR1_CH4FLT_Msk                      (0x7000UL)            /*!<CH4FLT(Bitfield-Mask:0x07)*/
#define GTIM_CR1_CH3POL_Pos                      (11UL)            /*!<CH3POL(Bit11)*/
#define GTIM_CR1_CH3POL_Msk                      (0x800UL)            /*!<CH3POL(Bitfield-Mask:0x01)*/
#define GTIM_CR1_CH3FLT_Pos                      (8UL)            /*!<CH3FLT(Bit8)*/
#define GTIM_CR1_CH3FLT_Msk                      (0x700UL)            /*!<CH3FLT(Bitfield-Mask:0x07)*/
#define GTIM_CR1_CH2POL_Pos                      (7UL)            /*!<CH2POL(Bit7)*/
#define GTIM_CR1_CH2POL_Msk                      (0x80UL)            /*!<CH2POL(Bitfield-Mask:0x01)*/
#define GTIM_CR1_CH2FLT_Pos                      (4UL)            /*!<CH2FLT(Bit4)*/
#define GTIM_CR1_CH2FLT_Msk                      (0x70UL)            /*!<CH2FLT(Bitfield-Mask:0x07)*/
#define GTIM_CR1_CH1POL_Pos                      (3UL)            /*!<CH1POL(Bit3)*/
#define GTIM_CR1_CH1POL_Msk                      (0x8UL)            /*!<CH1POL(Bitfield-Mask:0x01)*/
#define GTIM_CR1_CH1FLT_Pos                      (0UL)            /*!<CH1FLT(Bit0)*/
#define GTIM_CR1_CH1FLT_Msk                      (0x7UL)            /*!<CH1FLT(Bitfield-Mask:0x07)*/


/* =========================================================================================================================== */
/* ================                                            I2C                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  BRREN  ========================================================= */
#define I2C_BRREN_EN_Pos                         (0UL)            /*!<EN(Bit0)*/
#define I2C_BRREN_EN_Msk                         (0x1UL)            /*!<EN(Bitfield-Mask:0x01)*/
/* ==========================================================  BRR  ========================================================== */
#define I2C_BRR_BRR_Pos                          (0UL)            /*!<BRR(Bit0)*/
#define I2C_BRR_BRR_Msk                          (0xffUL)            /*!<BRR(Bitfield-Mask:0xff)*/
/* ==========================================================  CR  =========================================================== */
#define I2C_CR_EN_Pos                            (6UL)            /*!<EN(Bit6)*/
#define I2C_CR_EN_Msk                            (0x40UL)            /*!<EN(Bitfield-Mask:0x01)*/
#define I2C_CR_STA_Pos                           (5UL)            /*!<STA(Bit5)*/
#define I2C_CR_STA_Msk                           (0x20UL)            /*!<STA(Bitfield-Mask:0x01)*/
#define I2C_CR_STO_Pos                           (4UL)            /*!<STO(Bit4)*/
#define I2C_CR_STO_Msk                           (0x10UL)            /*!<STO(Bitfield-Mask:0x01)*/
#define I2C_CR_SI_Pos                            (3UL)            /*!<SI(Bit3)*/
#define I2C_CR_SI_Msk                            (0x8UL)            /*!<SI(Bitfield-Mask:0x01)*/
#define I2C_CR_AA_Pos                            (2UL)            /*!<AA(Bit2)*/
#define I2C_CR_AA_Msk                            (0x4UL)            /*!<AA(Bitfield-Mask:0x01)*/
#define I2C_CR_FLT_Pos                           (0UL)            /*!<FLT(Bit0)*/
#define I2C_CR_FLT_Msk                           (0x1UL)            /*!<FLT(Bitfield-Mask:0x01)*/
/* ==========================================================  DR  =========================================================== */
#define I2C_DR_DR_Pos                            (0UL)            /*!<DR(Bit0)*/
#define I2C_DR_DR_Msk                            (0xffUL)            /*!<DR(Bitfield-Mask:0xff)*/
/* =========================================================  ADDR0  ========================================================= */
#define I2C_ADDR0_ADDR0_Pos                      (1UL)            /*!<ADDR0(Bit1)*/
#define I2C_ADDR0_ADDR0_Msk                      (0xfeUL)            /*!<ADDR0(Bitfield-Mask:0x7f)*/
#define I2C_ADDR0_GC_Pos                         (0UL)            /*!<GC(Bit0)*/
#define I2C_ADDR0_GC_Msk                         (0x1UL)            /*!<GC(Bitfield-Mask:0x01)*/
/* =========================================================  STAT  ========================================================== */
#define I2C_STAT_STAT_Pos                        (0UL)            /*!<STAT(Bit0)*/
#define I2C_STAT_STAT_Msk                        (0xffUL)            /*!<STAT(Bitfield-Mask:0xff)*/
/* =========================================================  ADDR1  ========================================================= */
#define I2C_ADDR1_ADDR1_Pos                      (1UL)            /*!<ADDR1(Bit1)*/
#define I2C_ADDR1_ADDR1_Msk                      (0xfeUL)            /*!<ADDR1(Bitfield-Mask:0x7f)*/
/* =========================================================  ADDR2  ========================================================= */
#define I2C_ADDR2_ADDR2_Pos                      (1UL)            /*!<ADDR2(Bit1)*/
#define I2C_ADDR2_ADDR2_Msk                      (0xfeUL)            /*!<ADDR2(Bitfield-Mask:0x7f)*/
/* =========================================================  MATCH  ========================================================= */
#define I2C_MATCH_ADDR2_Pos                      (2UL)            /*!<ADDR2(Bit2)*/
#define I2C_MATCH_ADDR2_Msk                      (0x4UL)            /*!<ADDR2(Bitfield-Mask:0x01)*/
#define I2C_MATCH_ADDR1_Pos                      (1UL)            /*!<ADDR1(Bit1)*/
#define I2C_MATCH_ADDR1_Msk                      (0x2UL)            /*!<ADDR1(Bitfield-Mask:0x01)*/
#define I2C_MATCH_ADDR0_Pos                      (0UL)            /*!<ADDR0(Bit0)*/
#define I2C_MATCH_ADDR0_Msk                      (0x1UL)            /*!<ADDR0(Bitfield-Mask:0x01)*/


/* =========================================================================================================================== */
/* ================                                           IWDT                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  KR  =========================================================== */
#define IWDT_KR_KR_Pos                           (0UL)            /*!<KR(Bit0)*/
#define IWDT_KR_KR_Msk                           (0xffffUL)            /*!<KR(Bitfield-Mask:0xffff)*/
/* ==========================================================  CR  =========================================================== */
#define IWDT_CR_PAUSE_Pos                        (5UL)            /*!<PAUSE(Bit5)*/
#define IWDT_CR_PAUSE_Msk                        (0x20UL)            /*!<PAUSE(Bitfield-Mask:0x01)*/
#define IWDT_CR_IE_Pos                           (4UL)            /*!<IE(Bit4)*/
#define IWDT_CR_IE_Msk                           (0x10UL)            /*!<IE(Bitfield-Mask:0x01)*/
#define IWDT_CR_ACTION_Pos                       (3UL)            /*!<ACTION(Bit3)*/
#define IWDT_CR_ACTION_Msk                       (0x8UL)            /*!<ACTION(Bitfield-Mask:0x01)*/
#define IWDT_CR_PRS_Pos                          (0UL)            /*!<PRS(Bit0)*/
#define IWDT_CR_PRS_Msk                          (0x7UL)            /*!<PRS(Bitfield-Mask:0x07)*/
/* ==========================================================  ARR  ========================================================== */
#define IWDT_ARR_ARR_Pos                         (0UL)            /*!<ARR(Bit0)*/
#define IWDT_ARR_ARR_Msk                         (0xfffUL)            /*!<ARR(Bitfield-Mask:0xfff)*/
/* ==========================================================  SR  =========================================================== */
#define IWDT_SR_RELOAD_Pos                       (5UL)            /*!<RELOAD(Bit5)*/
#define IWDT_SR_RELOAD_Msk                       (0x20UL)            /*!<RELOAD(Bitfield-Mask:0x01)*/
#define IWDT_SR_RUN_Pos                          (4UL)            /*!<RUN(Bit4)*/
#define IWDT_SR_RUN_Msk                          (0x10UL)            /*!<RUN(Bitfield-Mask:0x01)*/
#define IWDT_SR_OV_Pos                           (3UL)            /*!<OV(Bit3)*/
#define IWDT_SR_OV_Msk                           (0x8UL)            /*!<OV(Bitfield-Mask:0x01)*/
#define IWDT_SR_WINRF_Pos                        (2UL)            /*!<WINRF(Bit2)*/
#define IWDT_SR_WINRF_Msk                        (0x4UL)            /*!<WINRF(Bitfield-Mask:0x01)*/
#define IWDT_SR_ARRF_Pos                         (1UL)            /*!<ARRF(Bit1)*/
#define IWDT_SR_ARRF_Msk                         (0x2UL)            /*!<ARRF(Bitfield-Mask:0x01)*/
#define IWDT_SR_CRF_Pos                          (0UL)            /*!<CRF(Bit0)*/
#define IWDT_SR_CRF_Msk                          (0x1UL)            /*!<CRF(Bitfield-Mask:0x01)*/
/* =========================================================  WINR  ========================================================== */
#define IWDT_WINR_WINR_Pos                       (0UL)            /*!<WINR(Bit0)*/
#define IWDT_WINR_WINR_Msk                       (0xfffUL)            /*!<WINR(Bitfield-Mask:0xfff)*/
/* ==========================================================  CNT  ========================================================== */
#define IWDT_CNT_CNT_Pos                         (0UL)            /*!<CNT(Bit0)*/
#define IWDT_CNT_CNT_Msk                         (0xfffUL)            /*!<CNT(Bitfield-Mask:0xfff)*/


/* =========================================================================================================================== */
/* ================                                            LVD                                            ================ */
/* =========================================================================================================================== */

