21mw12/CW32_Voltammeter/电压电流表资料/数据手册及标准库资料/CW32F003_StandardPeripheralLib_V1.5/Libraries/inc/cw32f003.h
/* ==========================================================  CR0  ========================================================== */
#define LVD_CR0_IE_Pos                           (9UL)            /*!<IE(Bit9)*/
#define LVD_CR0_IE_Msk                           (0x200UL)            /*!<IE(Bitfield-Mask:0x01)*/
#define LVD_CR0_VTH_Pos                          (4UL)            /*!<VTH(Bit4)*/
#define LVD_CR0_VTH_Msk                          (0xf0UL)            /*!<VTH(Bitfield-Mask:0x0f)*/
#define LVD_CR0_SOURCE_Pos                       (2UL)            /*!<SOURCE(Bit2)*/
#define LVD_CR0_SOURCE_Msk                       (0xcUL)            /*!<SOURCE(Bitfield-Mask:0x03)*/
#define LVD_CR0_ACTION_Pos                       (1UL)            /*!<ACTION(Bit1)*/
#define LVD_CR0_ACTION_Msk                       (0x2UL)            /*!<ACTION(Bitfield-Mask:0x01)*/
#define LVD_CR0_EN_Pos                           (0UL)            /*!<EN(Bit0)*/
#define LVD_CR0_EN_Msk                           (0x1UL)            /*!<EN(Bitfield-Mask:0x01)*/
/* ==========================================================  CR1  ========================================================== */
#define LVD_CR1_LEVEL_Pos                        (7UL)            /*!<LEVEL(Bit7)*/
#define LVD_CR1_LEVEL_Msk                        (0x80UL)            /*!<LEVEL(Bitfield-Mask:0x01)*/
#define LVD_CR1_FALL_Pos                         (6UL)            /*!<FALL(Bit6)*/
#define LVD_CR1_FALL_Msk                         (0x40UL)            /*!<FALL(Bitfield-Mask:0x01)*/
#define LVD_CR1_RISE_Pos                         (5UL)            /*!<RISE(Bit5)*/
#define LVD_CR1_RISE_Msk                         (0x20UL)            /*!<RISE(Bitfield-Mask:0x01)*/
#define LVD_CR1_FLTCLK_Pos                       (4UL)            /*!<FLTCLK(Bit4)*/
#define LVD_CR1_FLTCLK_Msk                       (0x10UL)            /*!<FLTCLK(Bitfield-Mask:0x01)*/
#define LVD_CR1_FLTTIME_Pos                      (1UL)            /*!<FLTTIME(Bit1)*/
#define LVD_CR1_FLTTIME_Msk                      (0xeUL)            /*!<FLTTIME(Bitfield-Mask:0x07)*/
#define LVD_CR1_FLTEN_Pos                        (0UL)            /*!<FLTEN(Bit0)*/
#define LVD_CR1_FLTEN_Msk                        (0x1UL)            /*!<FLTEN(Bitfield-Mask:0x01)*/
/* ==========================================================  SR  =========================================================== */
#define LVD_SR_FLTV_Pos                          (1UL)            /*!<FLTV(Bit1)*/
#define LVD_SR_FLTV_Msk                          (0x2UL)            /*!<FLTV(Bitfield-Mask:0x01)*/
#define LVD_SR_INTF_Pos                          (0UL)            /*!<INTF(Bit0)*/
#define LVD_SR_INTF_Msk                          (0x1UL)            /*!<INTF(Bitfield-Mask:0x01)*/


/* =========================================================================================================================== */
/* ================                                            RAM                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  IER  ========================================================== */
#define RAM_IER_PARITY_Pos                       (1UL)            /*!<PARITY(Bit1)*/
#define RAM_IER_PARITY_Msk                       (0x2UL)            /*!<PARITY(Bitfield-Mask:0x01)*/
#define RAM_IER_EN_Pos                           (0UL)            /*!<EN(Bit0)*/
#define RAM_IER_EN_Msk                           (0x1UL)            /*!<EN(Bitfield-Mask:0x01)*/
/* =========================================================  ADDR  ========================================================== */
#define RAM_ADDR_ADDR_Pos                        (0UL)            /*!<ADDR(Bit0)*/
#define RAM_ADDR_ADDR_Msk                        (0xffffffffUL)            /*!<ADDR(Bitfield-Mask:0xffffffff)*/
/* ==========================================================  ISR  ========================================================== */
#define RAM_ISR_PARITY_Pos                       (0UL)            /*!<PARITY(Bit0)*/
#define RAM_ISR_PARITY_Msk                       (0x1UL)            /*!<PARITY(Bitfield-Mask:0x01)*/
/* ==========================================================  ICR  ========================================================== */
#define RAM_ICR_PARITY_Pos                       (0UL)            /*!<PARITY(Bit0)*/
#define RAM_ICR_PARITY_Msk                       (0x1UL)            /*!<PARITY(Bitfield-Mask:0x01)*/


/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR1  ========================================================== */
#define SPI_CR1_MISOHD_Pos                       (18UL)            /*!<MISOHD(Bit18)*/
#define SPI_CR1_MISOHD_Msk                       (0x40000UL)            /*!<MISOHD(Bitfield-Mask:0x01)*/
#define SPI_CR1_MODE_Pos                         (14UL)            /*!<MODE(Bit14)*/
#define SPI_CR1_MODE_Msk                         (0xc000UL)            /*!<MODE(Bitfield-Mask:0x03)*/
#define SPI_CR1_WIDTH_Pos                        (10UL)            /*!<WIDTH(Bit10)*/
#define SPI_CR1_WIDTH_Msk                        (0x3c00UL)            /*!<WIDTH(Bitfield-Mask:0x0f)*/
#define SPI_CR1_SSM_Pos                          (9UL)            /*!<SSM(Bit9)*/
#define SPI_CR1_SSM_Msk                          (0x200UL)            /*!<SSM(Bitfield-Mask:0x01)*/
#define SPI_CR1_SMP_Pos                          (8UL)            /*!<SMP(Bit8)*/
#define SPI_CR1_SMP_Msk                          (0x100UL)            /*!<SMP(Bitfield-Mask:0x01)*/
#define SPI_CR1_LSBF_Pos                         (7UL)            /*!<LSBF(Bit7)*/
#define SPI_CR1_LSBF_Msk                         (0x80UL)            /*!<LSBF(Bitfield-Mask:0x01)*/
#define SPI_CR1_EN_Pos                           (6UL)            /*!<EN(Bit6)*/
#define SPI_CR1_EN_Msk                           (0x40UL)            /*!<EN(Bitfield-Mask:0x01)*/
#define SPI_CR1_BR_Pos                           (3UL)            /*!<BR(Bit3)*/
#define SPI_CR1_BR_Msk                           (0x38UL)            /*!<BR(Bitfield-Mask:0x07)*/
#define SPI_CR1_MSTR_Pos                         (2UL)            /*!<MSTR(Bit2)*/
#define SPI_CR1_MSTR_Msk                         (0x4UL)            /*!<MSTR(Bitfield-Mask:0x01)*/
#define SPI_CR1_CPOL_Pos                         (1UL)            /*!<CPOL(Bit1)*/
#define SPI_CR1_CPOL_Msk                         (0x2UL)            /*!<CPOL(Bitfield-Mask:0x01)*/
#define SPI_CR1_CPHA_Pos                         (0UL)            /*!<CPHA(Bit0)*/
#define SPI_CR1_CPHA_Msk                         (0x1UL)            /*!<CPHA(Bitfield-Mask:0x01)*/
/* ==========================================================  IER  ========================================================== */
#define SPI_IER_MODF_Pos                         (7UL)            /*!<MODF(Bit7)*/
#define SPI_IER_MODF_Msk                         (0x80UL)            /*!<MODF(Bitfield-Mask:0x01)*/
#define SPI_IER_SSERR_Pos                        (6UL)            /*!<SSERR(Bit6)*/
#define SPI_IER_SSERR_Msk                        (0x40UL)            /*!<SSERR(Bitfield-Mask:0x01)*/
#define SPI_IER_OV_Pos                           (5UL)            /*!<OV(Bit5)*/
#define SPI_IER_OV_Msk                           (0x20UL)            /*!<OV(Bitfield-Mask:0x01)*/
#define SPI_IER_UD_Pos                           (4UL)            /*!<UD(Bit4)*/
#define SPI_IER_UD_Msk                           (0x10UL)            /*!<UD(Bitfield-Mask:0x01)*/
#define SPI_IER_SSR_Pos                          (3UL)            /*!<SSR(Bit3)*/
#define SPI_IER_SSR_Msk                          (0x8UL)            /*!<SSR(Bitfield-Mask:0x01)*/
#define SPI_IER_SSF_Pos                          (2UL)            /*!<SSF(Bit2)*/
#define SPI_IER_SSF_Msk                          (0x4UL)            /*!<SSF(Bitfield-Mask:0x01)*/
#define SPI_IER_RXNE_Pos                         (1UL)            /*!<RXNE(Bit1)*/
#define SPI_IER_RXNE_Msk                         (0x2UL)            /*!<RXNE(Bitfield-Mask:0x01)*/
#define SPI_IER_TXE_Pos                          (0UL)            /*!<TXE(Bit0)*/
#define SPI_IER_TXE_Msk                          (0x1UL)            /*!<TXE(Bitfield-Mask:0x01)*/
/* ==========================================================  CR2  ========================================================== */
#define SPI_CR2_HDOE_Pos                         (0UL)            /*!<HDOE(Bit0)*/
#define SPI_CR2_HDOE_Msk                         (0x1UL)            /*!<HDOE(Bitfield-Mask:0x01)*/
/* ==========================================================  SSI  ========================================================== */
#define SPI_SSI_SSI_Pos                          (0UL)            /*!<SSI(Bit0)*/
#define SPI_SSI_SSI_Msk                          (0x1UL)            /*!<SSI(Bitfield-Mask:0x01)*/
/* ==========================================================  ISR  ========================================================== */
#define SPI_ISR_SSLVL_Pos                        (9UL)            /*!<SSLVL(Bit9)*/
#define SPI_ISR_SSLVL_Msk                        (0x200UL)            /*!<SSLVL(Bitfield-Mask:0x01)*/
#define SPI_ISR_BUSY_Pos                         (8UL)            /*!<BUSY(Bit8)*/
#define SPI_ISR_BUSY_Msk                         (0x100UL)            /*!<BUSY(Bitfield-Mask:0x01)*/
#define SPI_ISR_MODF_Pos                         (7UL)            /*!<MODF(Bit7)*/
#define SPI_ISR_MODF_Msk                         (0x80UL)            /*!<MODF(Bitfield-Mask:0x01)*/
#define SPI_ISR_SSERR_Pos                        (6UL)            /*!<SSERR(Bit6)*/
#define SPI_ISR_SSERR_Msk                        (0x40UL)            /*!<SSERR(Bitfield-Mask:0x01)*/
#define SPI_ISR_OV_Pos                           (5UL)            /*!<OV(Bit5)*/
#define SPI_ISR_OV_Msk                           (0x20UL)            /*!<OV(Bitfield-Mask:0x01)*/
#define SPI_ISR_UD_Pos                           (4UL)            /*!<UD(Bit4)*/
#define SPI_ISR_UD_Msk                           (0x10UL)            /*!<UD(Bitfield-Mask:0x01)*/
#define SPI_ISR_SSR_Pos                          (3UL)            /*!<SSR(Bit3)*/
#define SPI_ISR_SSR_Msk                          (0x8UL)            /*!<SSR(Bitfield-Mask:0x01)*/
#define SPI_ISR_SSF_Pos                          (2UL)            /*!<SSF(Bit2)*/
#define SPI_ISR_SSF_Msk                          (0x4UL)            /*!<SSF(Bitfield-Mask:0x01)*/
#define SPI_ISR_RXNE_Pos                         (1UL)            /*!<RXNE(Bit1)*/
#define SPI_ISR_RXNE_Msk                         (0x2UL)            /*!<RXNE(Bitfield-Mask:0x01)*/
#define SPI_ISR_TXE_Pos                          (0UL)            /*!<TXE(Bit0)*/
#define SPI_ISR_TXE_Msk                          (0x1UL)            /*!<TXE(Bitfield-Mask:0x01)*/
/* ==========================================================  ICR  ========================================================== */
#define SPI_ICR_MODF_Pos                         (7UL)            /*!<MODF(Bit7)*/
#define SPI_ICR_MODF_Msk                         (0x80UL)            /*!<MODF(Bitfield-Mask:0x01)*/
#define SPI_ICR_SSERR_Pos                        (6UL)            /*!<SSERR(Bit6)*/
#define SPI_ICR_SSERR_Msk                        (0x40UL)            /*!<SSERR(Bitfield-Mask:0x01)*/
#define SPI_ICR_OV_Pos                           (5UL)            /*!<OV(Bit5)*/
#define SPI_ICR_OV_Msk                           (0x20UL)            /*!<OV(Bitfield-Mask:0x01)*/
#define SPI_ICR_UD_Pos                           (4UL)            /*!<UD(Bit4)*/
#define SPI_ICR_UD_Msk                           (0x10UL)            /*!<UD(Bitfield-Mask:0x01)*/
#define SPI_ICR_SSR_Pos                          (3UL)            /*!<SSR(Bit3)*/
#define SPI_ICR_SSR_Msk                          (0x8UL)            /*!<SSR(Bitfield-Mask:0x01)*/
#define SPI_ICR_SSF_Pos                          (2UL)            /*!<SSF(Bit2)*/
#define SPI_ICR_SSF_Msk                          (0x4UL)            /*!<SSF(Bitfield-Mask:0x01)*/
#define SPI_ICR_RXNE_Pos                         (1UL)            /*!<RXNE(Bit1)*/
#define SPI_ICR_RXNE_Msk                         (0x2UL)            /*!<RXNE(Bitfield-Mask:0x01)*/
#define SPI_ICR_FLUSH_Pos                        (0UL)            /*!<FLUSH(Bit0)*/
#define SPI_ICR_FLUSH_Msk                        (0x1UL)            /*!<FLUSH(Bitfield-Mask:0x01)*/
/* ==========================================================  DR  =========================================================== */
#define SPI_DR_DR_Pos                            (0UL)            /*!<DR(Bit0)*/
#define SPI_DR_DR_Msk                            (0xffffUL)            /*!<DR(Bitfield-Mask:0xffff)*/


/* =========================================================================================================================== */
/* ================                                          SYSCTRL                                          ================ */
/* =========================================================================================================================== */

