21mw12/CW32_Voltammeter/电压电流表资料/数据手册及标准库资料/CW32F003_StandardPeripheralLib_V1.5/Libraries/inc/cw32f003.h
/* ==========================================================  CR0  ========================================================== */
#define SYSCTRL_CR0_KEY_Pos                      (16UL)            /*!<KEY(Bit16)*/
#define SYSCTRL_CR0_KEY_Msk                      (0xffff0000UL)            /*!<KEY(Bitfield-Mask:0xffff)*/
#define SYSCTRL_CR0_HCLKPRS_Pos                  (5UL)            /*!<HCLKPRS(Bit5)*/
#define SYSCTRL_CR0_HCLKPRS_Msk                  (0xe0UL)            /*!<HCLKPRS(Bitfield-Mask:0x07)*/
#define SYSCTRL_CR0_PCLKPRS_Pos                  (3UL)            /*!<PCLKPRS(Bit3)*/
#define SYSCTRL_CR0_PCLKPRS_Msk                  (0x18UL)            /*!<PCLKPRS(Bitfield-Mask:0x03)*/
#define SYSCTRL_CR0_SYSCLK_Pos                   (0UL)            /*!<SYSCLK(Bit0)*/
#define SYSCTRL_CR0_SYSCLK_Msk                   (0x7UL)            /*!<SYSCLK(Bitfield-Mask:0x07)*/
/* ==========================================================  CR1  ========================================================== */
#define SYSCTRL_CR1_KEY_Pos                      (16UL)            /*!<KEY(Bit16)*/
#define SYSCTRL_CR1_KEY_Msk                      (0xffff0000UL)            /*!<KEY(Bitfield-Mask:0xffff)*/
#define SYSCTRL_CR1_LSIEN_Pos                    (3UL)            /*!<LSIEN(Bit3)*/
#define SYSCTRL_CR1_LSIEN_Msk                    (0x8UL)            /*!<LSIEN(Bitfield-Mask:0x01)*/
#define SYSCTRL_CR1_HEXEN_Pos                    (1UL)            /*!<HEXEN(Bit1)*/
#define SYSCTRL_CR1_HEXEN_Msk                    (0x2UL)            /*!<HEXEN(Bitfield-Mask:0x01)*/
#define SYSCTRL_CR1_HSIEN_Pos                    (0UL)            /*!<HSIEN(Bit0)*/
#define SYSCTRL_CR1_HSIEN_Msk                    (0x1UL)            /*!<HSIEN(Bitfield-Mask:0x01)*/
/* ==========================================================  CR2  ========================================================== */
#define SYSCTRL_CR2_KEY_Pos                      (16UL)            /*!<KEY(Bit16)*/
#define SYSCTRL_CR2_KEY_Msk                      (0xffff0000UL)            /*!<KEY(Bitfield-Mask:0xffff)*/
#define SYSCTRL_CR2_WAKEUPCLK_Pos                (3UL)            /*!<WAKEUPCLK(Bit3)*/
#define SYSCTRL_CR2_WAKEUPCLK_Msk                (0x8UL)            /*!<WAKEUPCLK(Bitfield-Mask:0x01)*/
#define SYSCTRL_CR2_LOCKUP_Pos                   (2UL)            /*!<LOCKUP(Bit2)*/
#define SYSCTRL_CR2_LOCKUP_Msk                   (0x4UL)            /*!<LOCKUP(Bitfield-Mask:0x01)*/
#define SYSCTRL_CR2_SWDIO_Pos                    (1UL)            /*!<SWDIO(Bit1)*/
#define SYSCTRL_CR2_SWDIO_Msk                    (0x2UL)            /*!<SWDIO(Bitfield-Mask:0x01)*/
#define SYSCTRL_CR2_RSTIO_Pos                    (0UL)            /*!<RSTIO(Bit0)*/
#define SYSCTRL_CR2_RSTIO_Msk                    (0x1UL)            /*!<RSTIO(Bitfield-Mask:0x01)*/
/* ==========================================================  IER  ========================================================== */
#define SYSCTRL_IER_KEY_Pos                      (16UL)            /*!<KEY(Bit16)*/
#define SYSCTRL_IER_KEY_Msk                      (0xffff0000UL)            /*!<KEY(Bitfield-Mask:0xffff)*/
#define SYSCTRL_IER_LSIRDY_Pos                   (3UL)            /*!<LSIRDY(Bit3)*/
#define SYSCTRL_IER_LSIRDY_Msk                   (0x8UL)            /*!<LSIRDY(Bitfield-Mask:0x01)*/
#define SYSCTRL_IER_HEXRDY_Pos                   (1UL)            /*!<HEXRDY(Bit1)*/
#define SYSCTRL_IER_HEXRDY_Msk                   (0x2UL)            /*!<HEXRDY(Bitfield-Mask:0x01)*/
#define SYSCTRL_IER_HSIRDY_Pos                   (0UL)            /*!<HSIRDY(Bit0)*/
#define SYSCTRL_IER_HSIRDY_Msk                   (0x1UL)            /*!<HSIRDY(Bitfield-Mask:0x01)*/
/* ==========================================================  ISR  ========================================================== */
#define SYSCTRL_ISR_LSISTABLE_Pos                (14UL)            /*!<LSISTABLE(Bit14)*/
#define SYSCTRL_ISR_LSISTABLE_Msk                (0x4000UL)            /*!<LSISTABLE(Bitfield-Mask:0x01)*/
#define SYSCTRL_ISR_HEXSTABLE_Pos                (12UL)            /*!<HEXSTABLE(Bit12)*/
#define SYSCTRL_ISR_HEXSTABLE_Msk                (0x1000UL)            /*!<HEXSTABLE(Bitfield-Mask:0x01)*/
#define SYSCTRL_ISR_HSISTABLE_Pos                (11UL)            /*!<HSISTABLE(Bit11)*/
#define SYSCTRL_ISR_HSISTABLE_Msk                (0x800UL)            /*!<HSISTABLE(Bitfield-Mask:0x01)*/
#define SYSCTRL_ISR_LSIRDY_Pos                   (3UL)            /*!<LSIRDY(Bit3)*/
#define SYSCTRL_ISR_LSIRDY_Msk                   (0x8UL)            /*!<LSIRDY(Bitfield-Mask:0x01)*/
#define SYSCTRL_ISR_HEXRDY_Pos                   (1UL)            /*!<HEXRDY(Bit1)*/
#define SYSCTRL_ISR_HEXRDY_Msk                   (0x2UL)            /*!<HEXRDY(Bitfield-Mask:0x01)*/
#define SYSCTRL_ISR_HSIRDY_Pos                   (0UL)            /*!<HSIRDY(Bit0)*/
#define SYSCTRL_ISR_HSIRDY_Msk                   (0x1UL)            /*!<HSIRDY(Bitfield-Mask:0x01)*/
/* ==========================================================  ICR  ========================================================== */
#define SYSCTRL_ICR_LSIRDY_Pos                   (3UL)            /*!<LSIRDY(Bit3)*/
#define SYSCTRL_ICR_LSIRDY_Msk                   (0x8UL)            /*!<LSIRDY(Bitfield-Mask:0x01)*/
#define SYSCTRL_ICR_HEXRDY_Pos                   (1UL)            /*!<HEXRDY(Bit1)*/
#define SYSCTRL_ICR_HEXRDY_Msk                   (0x2UL)            /*!<HEXRDY(Bitfield-Mask:0x01)*/
#define SYSCTRL_ICR_HSIRDY_Pos                   (0UL)            /*!<HSIRDY(Bit0)*/
#define SYSCTRL_ICR_HSIRDY_Msk                   (0x1UL)            /*!<HSIRDY(Bitfield-Mask:0x01)*/
/* ==========================================================  HSI  ========================================================== */
#define SYSCTRL_HSI_STABLE_Pos                   (15UL)            /*!<STABLE(Bit15)*/
#define SYSCTRL_HSI_STABLE_Msk                   (0x8000UL)            /*!<STABLE(Bitfield-Mask:0x01)*/
#define SYSCTRL_HSI_DIV_Pos                      (11UL)            /*!<DIV(Bit11)*/
#define SYSCTRL_HSI_DIV_Msk                      (0x7800UL)            /*!<DIV(Bitfield-Mask:0x0f)*/
#define SYSCTRL_HSI_TRIM_Pos                     (0UL)            /*!<TRIM(Bit0)*/
#define SYSCTRL_HSI_TRIM_Msk                     (0x7ffUL)            /*!<TRIM(Bitfield-Mask:0x7ff)*/
/* ==========================================================  HEX  ========================================================== */
#define SYSCTRL_HEX_STABLE_Pos                   (19UL)            /*!<STABLE(Bit19)*/
#define SYSCTRL_HEX_STABLE_Msk                   (0x80000UL)            /*!<STABLE(Bitfield-Mask:0x01)*/
#define SYSCTRL_HEX_PINMUX_Pos                   (7UL)            /*!<PINMUX(Bit7)*/
#define SYSCTRL_HEX_PINMUX_Msk                   (0x80UL)            /*!<PINMUX(Bitfield-Mask:0x01)*/
#define SYSCTRL_HEX_PINEN_Pos                    (6UL)            /*!<PINEN(Bit6)*/
#define SYSCTRL_HEX_PINEN_Msk                    (0x40UL)            /*!<PINEN(Bitfield-Mask:0x01)*/
/* ==========================================================  LSI  ========================================================== */
#define SYSCTRL_LSI_STABLE_Pos                   (15UL)            /*!<STABLE(Bit15)*/
#define SYSCTRL_LSI_STABLE_Msk                   (0x8000UL)            /*!<STABLE(Bitfield-Mask:0x01)*/
#define SYSCTRL_LSI_WAITCYCLE_Pos                (10UL)            /*!<WAITCYCLE(Bit10)*/
#define SYSCTRL_LSI_WAITCYCLE_Msk                (0xc00UL)            /*!<WAITCYCLE(Bitfield-Mask:0x03)*/
#define SYSCTRL_LSI_TRIM_Pos                     (0UL)            /*!<TRIM(Bit0)*/
#define SYSCTRL_LSI_TRIM_Msk                     (0x3ffUL)            /*!<TRIM(Bitfield-Mask:0x3ff)*/
/* =========================================================  DEBUG  ========================================================= */
#define SYSCTRL_DEBUG_WWDT_Pos                   (10UL)            /*!<WWDT(Bit10)*/
#define SYSCTRL_DEBUG_WWDT_Msk                   (0x400UL)            /*!<WWDT(Bitfield-Mask:0x01)*/
#define SYSCTRL_DEBUG_IWDT_Pos                   (9UL)            /*!<IWDT(Bit9)*/
#define SYSCTRL_DEBUG_IWDT_Msk                   (0x200UL)            /*!<IWDT(Bitfield-Mask:0x01)*/
#define SYSCTRL_DEBUG_AWT_Pos                    (6UL)            /*!<AWT(Bit6)*/
#define SYSCTRL_DEBUG_AWT_Msk                    (0x40UL)            /*!<AWT(Bitfield-Mask:0x01)*/
#define SYSCTRL_DEBUG_BTIM123_Pos                (5UL)            /*!<BTIM123(Bit5)*/
#define SYSCTRL_DEBUG_BTIM123_Msk                (0x20UL)            /*!<BTIM123(Bitfield-Mask:0x01)*/
#define SYSCTRL_DEBUG_GTIM_Pos                   (1UL)            /*!<GTIM(Bit1)*/
#define SYSCTRL_DEBUG_GTIM_Msk                   (0x2UL)            /*!<GTIM(Bitfield-Mask:0x01)*/
#define SYSCTRL_DEBUG_ATIM_Pos                   (0UL)            /*!<ATIM(Bit0)*/
#define SYSCTRL_DEBUG_ATIM_Msk                   (0x1UL)            /*!<ATIM(Bitfield-Mask:0x01)*/
/* =========================================================  AHBEN  ========================================================= */
#define SYSCTRL_AHBEN_GPIOC_Pos                  (6UL)            /*!<GPIOC(Bit6)*/
#define SYSCTRL_AHBEN_GPIOC_Msk                  (0x40UL)            /*!<GPIOC(Bitfield-Mask:0x01)*/
#define SYSCTRL_AHBEN_GPIOB_Pos                  (5UL)            /*!<GPIOB(Bit5)*/
#define SYSCTRL_AHBEN_GPIOB_Msk                  (0x20UL)            /*!<GPIOB(Bitfield-Mask:0x01)*/
#define SYSCTRL_AHBEN_GPIOA_Pos                  (4UL)            /*!<GPIOA(Bit4)*/
#define SYSCTRL_AHBEN_GPIOA_Msk                  (0x10UL)            /*!<GPIOA(Bitfield-Mask:0x01)*/
#define SYSCTRL_AHBEN_CRC_Pos                    (2UL)            /*!<CRC(Bit2)*/
#define SYSCTRL_AHBEN_CRC_Msk                    (0x4UL)            /*!<CRC(Bitfield-Mask:0x01)*/
#define SYSCTRL_AHBEN_FLASH_Pos                  (1UL)            /*!<FLASH(Bit1)*/
#define SYSCTRL_AHBEN_FLASH_Msk                  (0x2UL)            /*!<FLASH(Bitfield-Mask:0x01)*/
/* ========================================================  APBEN2  ========================================================= */
#define SYSCTRL_APBEN2_AWT_Pos                   (13UL)            /*!<AWT(Bit13)*/
#define SYSCTRL_APBEN2_AWT_Msk                   (0x2000UL)            /*!<AWT(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBEN2_BTIM_Pos                  (12UL)            /*!<BTIM(Bit12)*/
#define SYSCTRL_APBEN2_BTIM_Msk                  (0x1000UL)            /*!<BTIM(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBEN2_UART1_Pos                 (9UL)            /*!<UART1(Bit9)*/
#define SYSCTRL_APBEN2_UART1_Msk                 (0x200UL)            /*!<UART1(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBEN2_SPI_Pos                   (8UL)            /*!<SPI(Bit8)*/
#define SYSCTRL_APBEN2_SPI_Msk                   (0x100UL)            /*!<SPI(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBEN2_ATIM_Pos                  (7UL)            /*!<ATIM(Bit7)*/
#define SYSCTRL_APBEN2_ATIM_Msk                  (0x80UL)            /*!<ATIM(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBEN2_VC_Pos                    (4UL)            /*!<VC(Bit4)*/
#define SYSCTRL_APBEN2_VC_Msk                    (0x10UL)            /*!<VC(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBEN2_ADC_Pos                   (2UL)            /*!<ADC(Bit2)*/
#define SYSCTRL_APBEN2_ADC_Msk                   (0x4UL)            /*!<ADC(Bitfield-Mask:0x01)*/
/* ========================================================  APBEN1  ========================================================= */
#define SYSCTRL_APBEN1_I2C_Pos                   (11UL)            /*!<I2C(Bit11)*/
#define SYSCTRL_APBEN1_I2C_Msk                   (0x800UL)            /*!<I2C(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBEN1_UART2_Pos                 (7UL)            /*!<UART2(Bit7)*/
#define SYSCTRL_APBEN1_UART2_Msk                 (0x80UL)            /*!<UART2(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBEN1_IWDT_Pos                  (5UL)            /*!<IWDT(Bit5)*/
#define SYSCTRL_APBEN1_IWDT_Msk                  (0x20UL)            /*!<IWDT(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBEN1_WWDT_Pos                  (4UL)            /*!<WWDT(Bit4)*/
#define SYSCTRL_APBEN1_WWDT_Msk                  (0x10UL)            /*!<WWDT(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBEN1_GTIM_Pos                  (1UL)            /*!<GTIM(Bit1)*/
#define SYSCTRL_APBEN1_GTIM_Msk                  (0x2UL)            /*!<GTIM(Bitfield-Mask:0x01)*/
/* ========================================================  AHBRST  ========================================================= */
#define SYSCTRL_AHBRST_GPIOC_Pos                 (6UL)            /*!<GPIOC(Bit6)*/
#define SYSCTRL_AHBRST_GPIOC_Msk                 (0x40UL)            /*!<GPIOC(Bitfield-Mask:0x01)*/
#define SYSCTRL_AHBRST_GPIOB_Pos                 (5UL)            /*!<GPIOB(Bit5)*/
#define SYSCTRL_AHBRST_GPIOB_Msk                 (0x20UL)            /*!<GPIOB(Bitfield-Mask:0x01)*/
#define SYSCTRL_AHBRST_GPIOA_Pos                 (4UL)            /*!<GPIOA(Bit4)*/
#define SYSCTRL_AHBRST_GPIOA_Msk                 (0x10UL)            /*!<GPIOA(Bitfield-Mask:0x01)*/
#define SYSCTRL_AHBRST_CRC_Pos                   (2UL)            /*!<CRC(Bit2)*/
#define SYSCTRL_AHBRST_CRC_Msk                   (0x4UL)            /*!<CRC(Bitfield-Mask:0x01)*/
#define SYSCTRL_AHBRST_FLASH_Pos                 (1UL)            /*!<FLASH(Bit1)*/
#define SYSCTRL_AHBRST_FLASH_Msk                 (0x2UL)            /*!<FLASH(Bitfield-Mask:0x01)*/
/* ========================================================  APBRST2  ======================================================== */
#define SYSCTRL_APBRST2_AWT_Pos                  (13UL)            /*!<AWT(Bit13)*/
#define SYSCTRL_APBRST2_AWT_Msk                  (0x2000UL)            /*!<AWT(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBRST2_BTIM_Pos                 (12UL)            /*!<BTIM(Bit12)*/
#define SYSCTRL_APBRST2_BTIM_Msk                 (0x1000UL)            /*!<BTIM(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBRST2_UART1_Pos                (9UL)            /*!<UART1(Bit9)*/
#define SYSCTRL_APBRST2_UART1_Msk                (0x200UL)            /*!<UART1(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBRST2_SPI_Pos                  (8UL)            /*!<SPI(Bit8)*/
#define SYSCTRL_APBRST2_SPI_Msk                  (0x100UL)            /*!<SPI(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBRST2_ATIM_Pos                 (7UL)            /*!<ATIM(Bit7)*/
#define SYSCTRL_APBRST2_ATIM_Msk                 (0x80UL)            /*!<ATIM(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBRST2_VC_Pos                   (4UL)            /*!<VC(Bit4)*/
#define SYSCTRL_APBRST2_VC_Msk                   (0x10UL)            /*!<VC(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBRST2_ADC_Pos                  (2UL)            /*!<ADC(Bit2)*/
#define SYSCTRL_APBRST2_ADC_Msk                  (0x4UL)            /*!<ADC(Bitfield-Mask:0x01)*/
/* ========================================================  APBRST1  ======================================================== */
#define SYSCTRL_APBRST1_I2C_Pos                  (11UL)            /*!<I2C(Bit11)*/
#define SYSCTRL_APBRST1_I2C_Msk                  (0x800UL)            /*!<I2C(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBRST1_UART2_Pos                (7UL)            /*!<UART2(Bit7)*/
#define SYSCTRL_APBRST1_UART2_Msk                (0x80UL)            /*!<UART2(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBRST1_IWDT_Pos                 (5UL)            /*!<IWDT(Bit5)*/
#define SYSCTRL_APBRST1_IWDT_Msk                 (0x20UL)            /*!<IWDT(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBRST1_WWDT_Pos                 (4UL)            /*!<WWDT(Bit4)*/
#define SYSCTRL_APBRST1_WWDT_Msk                 (0x10UL)            /*!<WWDT(Bitfield-Mask:0x01)*/
#define SYSCTRL_APBRST1_GTIM_Pos                 (1UL)            /*!<GTIM(Bit1)*/
#define SYSCTRL_APBRST1_GTIM_Msk                 (0x2UL)            /*!<GTIM(Bitfield-Mask:0x01)*/
/* =======================================================  RESETFLAG  ======================================================= */
#define SYSCTRL_RESETFLAG_SYSRESETREQ_Pos        (9UL)            /*!<SYSRESETREQ(Bit9)*/
#define SYSCTRL_RESETFLAG_SYSRESETREQ_Msk        (0x200UL)            /*!<SYSRESETREQ(Bitfield-Mask:0x01)*/
#define SYSCTRL_RESETFLAG_LOCKUP_Pos             (8UL)            /*!<LOCKUP(Bit8)*/
#define SYSCTRL_RESETFLAG_LOCKUP_Msk             (0x100UL)            /*!<LOCKUP(Bitfield-Mask:0x01)*/
#define SYSCTRL_RESETFLAG_RSTB_Pos               (6UL)            /*!<RSTB(Bit6)*/
#define SYSCTRL_RESETFLAG_RSTB_Msk               (0x40UL)            /*!<RSTB(Bitfield-Mask:0x01)*/
#define SYSCTRL_RESETFLAG_WWDT_Pos               (5UL)            /*!<WWDT(Bit5)*/
#define SYSCTRL_RESETFLAG_WWDT_Msk               (0x20UL)            /*!<WWDT(Bitfield-Mask:0x01)*/
#define SYSCTRL_RESETFLAG_IWDT_Pos               (4UL)            /*!<IWDT(Bit4)*/
#define SYSCTRL_RESETFLAG_IWDT_Msk               (0x10UL)            /*!<IWDT(Bitfield-Mask:0x01)*/
#define SYSCTRL_RESETFLAG_LVD_Pos                (3UL)            /*!<LVD(Bit3)*/
#define SYSCTRL_RESETFLAG_LVD_Msk                (0x8UL)            /*!<LVD(Bitfield-Mask:0x01)*/
#define SYSCTRL_RESETFLAG_POR_Pos                (0UL)            /*!<POR(Bit0)*/
#define SYSCTRL_RESETFLAG_POR_Msk                (0x1UL)            /*!<POR(Bitfield-Mask:0x01)*/
/* ========================================================  GTIMCAP  ======================================================== */
#define SYSCTRL_GTIMCAP_CH4_Pos                  (12UL)            /*!<CH4(Bit12)*/
#define SYSCTRL_GTIMCAP_CH4_Msk                  (0x7000UL)            /*!<CH4(Bitfield-Mask:0x07)*/
#define SYSCTRL_GTIMCAP_CH3_Pos                  (8UL)            /*!<CH3(Bit8)*/
#define SYSCTRL_GTIMCAP_CH3_Msk                  (0x700UL)            /*!<CH3(Bitfield-Mask:0x07)*/
#define SYSCTRL_GTIMCAP_CH2_Pos                  (4UL)            /*!<CH2(Bit4)*/
#define SYSCTRL_GTIMCAP_CH2_Msk                  (0x70UL)            /*!<CH2(Bitfield-Mask:0x07)*/
#define SYSCTRL_GTIMCAP_CH1_Pos                  (0UL)            /*!<CH1(Bit0)*/
#define SYSCTRL_GTIMCAP_CH1_Msk                  (0x7UL)            /*!<CH1(Bitfield-Mask:0x07)*/
/* ========================================================  ATIMETR  ======================================================== */
#define SYSCTRL_ATIMETR_ATIMETR_Pos              (0UL)            /*!<ATIMETR(Bit0)*/
#define SYSCTRL_ATIMETR_ATIMETR_Msk              (0x7UL)            /*!<ATIMETR(Bitfield-Mask:0x07)*/
/* ========================================================  GTIMETR  ======================================================== */
#define SYSCTRL_GTIMETR_GTIMETR_Pos              (0UL)            /*!<GTIMETR(Bit0)*/
#define SYSCTRL_GTIMETR_GTIMETR_Msk              (0x7UL)            /*!<GTIMETR(Bitfield-Mask:0x07)*/
/* ========================================================  TIMITR  ========================================================= */
#define SYSCTRL_TIMITR_BTIM3ITR_Pos              (21UL)            /*!<BTIM3ITR(Bit21)*/
#define SYSCTRL_TIMITR_BTIM3ITR_Msk              (0xe00000UL)            /*!<BTIM3ITR(Bitfield-Mask:0x07)*/
#define SYSCTRL_TIMITR_BTIM2ITR_Pos              (18UL)            /*!<BTIM2ITR(Bit18)*/
#define SYSCTRL_TIMITR_BTIM2ITR_Msk              (0x1c0000UL)            /*!<BTIM2ITR(Bitfield-Mask:0x07)*/
#define SYSCTRL_TIMITR_BTIM1ITR_Pos              (15UL)            /*!<BTIM1ITR(Bit15)*/
#define SYSCTRL_TIMITR_BTIM1ITR_Msk              (0x38000UL)            /*!<BTIM1ITR(Bitfield-Mask:0x07)*/
#define SYSCTRL_TIMITR_GTIMITR_Pos               (3UL)            /*!<GTIMITR(Bit3)*/
#define SYSCTRL_TIMITR_GTIMITR_Msk               (0x38UL)            /*!<GTIMITR(Bitfield-Mask:0x07)*/
#define SYSCTRL_TIMITR_ATIMITR_Pos               (0UL)            /*!<ATIMITR(Bit0)*/
#define SYSCTRL_TIMITR_ATIMITR_Msk               (0x7UL)            /*!<ATIMITR(Bitfield-Mask:0x07)*/
/* ==========================================================  MCO  ========================================================== */
#define SYSCTRL_MCO_DIV_Pos                      (4UL)            /*!<DIV(Bit4)*/
#define SYSCTRL_MCO_DIV_Msk                      (0x70UL)            /*!<DIV(Bitfield-Mask:0x07)*/
#define SYSCTRL_MCO_SOURCE_Pos                   (0UL)            /*!<SOURCE(Bit0)*/
#define SYSCTRL_MCO_SOURCE_Msk                   (0xfUL)            /*!<SOURCE(Bitfield-Mask:0x0f)*/
/* =========================================================  IRMOD  ========================================================= */
#define SYSCTRL_IRMOD_IRSW_Pos                   (4UL)            /*!<IRSW(Bit4)*/
#define SYSCTRL_IRMOD_IRSW_Msk                   (0x10UL)            /*!<IRSW(Bitfield-Mask:0x01)*/
#define SYSCTRL_IRMOD_MOD_Pos                    (0UL)            /*!<MOD(Bit0)*/
#define SYSCTRL_IRMOD_MOD_Msk                    (0xfUL)            /*!<MOD(Bitfield-Mask:0x0f)*/


/* =========================================================================================================================== */
/* ================                                           UART                                            ================ */
/* =========================================================================================================================== */

